#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x188 (0x4B0 - 0x328)
// Class FortniteGame.AIHotSpot
class AAIHotSpot : public AActor
{
public:
	uint8                                        Pad_BE1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAIHotSpotSlot*>                UserSlots;                                         // 0x330(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotSlotGenerator*               SlotGenerator;                                     // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAIHotSpotSlot*>                Slots;                                             // 0x348(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	class AActor*                                FocusActor;                                        // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CustomNavmeshSearchExtent;                         // 0x368(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartEnabled : 1;                                 // Mask: 0x1, PropSize: 0x10x374(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowSlotlessAssignment : 1;                      // Mask: 0x2, PropSize: 0x10x374(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowClaimingMultipleSlots : 1;                   // Mask: 0x4, PropSize: 0x10x374(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTrackOverlappingSlots : 1;                        // Mask: 0x8, PropSize: 0x10x374(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bProjectSlotsOnNavmesh : 1;                        // Mask: 0x10, PropSize: 0x10x374(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCustomNavmeshSearchExtent : 1;                    // Mask: 0x20, PropSize: 0x10x374(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x40, PropSize: 0x10x374(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_C4 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_BE3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AAIController*>                 NoSlotAssignees;                                   // 0x378(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_BE4[0x110];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   RenderingComponent;                                // 0x498(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                   SpriteComponent;                                   // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BE5[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAIHotSpot* GetDefaultObj();

	void SetEnabled(bool bEnabled);
	int32 RemoveGroupFromHotspot(const TArray<class AAIController*>& GroupOfAI);
	bool RemoveFromHotspot(class AAIController* AI, bool bAssignFromWaitingList);
	void OnSlotOccupied(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotFreed(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotEnabled(int32 Index, int32 UserId);
	void OnSlotDisabled(int32 Index, int32 UserId);
	void OnSlotClaimed(class AAIController* AI, int32 Index, int32 UserId);
	void OnSlotBlocked(class AAIController* AI, int32 Index, int32 UserId);
	void OnRemovedSlotlessBehavior(class AAIController* AI, bool bIsClamingSlot);
	void OnRemovedBehavior(class AAIController* AI, int32 Index, int32 UserId, enum class EAIHotSpotSlot PrevState, bool bWasOnWaitingList);
	void OnMoveToSlotFinished(class AAIController* AI, int32 Index, int32 UserId, bool bResult);
	void OnHotSpotEnabled();
	void OnHotSpotDisabled();
	bool OnAssignedSlotlessBehavior(class AAIController* AI);
	bool OnAssignedOccupiedBehavior(class AAIController* AI, int32 Index, int32 UserId);
	bool OnAssignedClaimedBehavior(class AAIController* AI, int32 Index, int32 UserId, bool bWasOnWaitingList);
	bool OccupySlotByIndex(int32 Index);
	bool IsSlotlessAssignmentAllowed();
	bool IsEnabled();
	bool IsAIAllowed(class AAIController* AI);
	bool HasEnabledSlots();
	bool HasAssignedAI(class AAIController* AI, enum class EAIHotSpotAssignmentFilter Filter);
	int32 GetSlotUserIdByIndex(int32 Index);
	enum class EAIHotSpotSlot GetSlotStateByOwner(class AAIController* AIOwner);
	enum class EAIHotSpotSlot GetSlotStateByIndex(int32 Index);
	struct FRotator GetSlotRotationByIndex(int32 Index);
	class AAIController* GetSlotOwnerByIndex(int32 Index);
	struct FVector GetSlotLocationByIndex(int32 Index);
	int32 GetSlotIndexByOwner(class AAIController* AIOwner);
	int32 GetSlotCount(enum class EAIHotSpotSlotFilter Filter);
	class UAIHotSpotSlot* GetSlotByOwner(class AAIController* AIOwner);
	class UAIHotSpotSlot* GetSlotByIndex(int32 Index);
	int32 GetAssignedAICount(enum class EAIHotSpotAssignmentFilter Filter);
	TArray<class AAIController*> GetAssignedAI(enum class EAIHotSpotAssignmentFilter Filter);
	TArray<int32> FindBestSlotIndices(const TArray<class AAIController*>& AI);
	int32 FindBestSlotIndex(class AAIController* AI);
	bool CanUseSlotByIndex(class AAIController* AI, int32 Index);
	bool AssignToSlotByIndex(class AAIController* AI, int32 Index);
	bool AssignToHotspot(class AAIController* AI);
	int32 AssignGroupToHotspot(const TArray<class AAIController*>& GroupOfAI);
	void AssignFromWaitingList();
};

// 0x20 (0x50 - 0x30)
// Class FortniteGame.AIHotSpotConfig
class UAIHotSpotConfig : public UDataAsset
{
public:
	TArray<struct FAIHotSpotSlotConfig>          Slots;                                             // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        bDetectUnreachableSlots : 1;                       // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_C5 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_BED[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlotGenerator*               SlotGenerator;                                     // 0x48(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIHotSpotConfig* GetDefaultObj();

};

// 0x58 (0x80 - 0x28)
// Class FortniteGame.AIHotSpotManagerProxy
class UAIHotSpotManagerProxy : public UAIHotSpotManager
{
public:
	uint8                                        Pad_BEE[0x58];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotManagerProxy* GetDefaultObj();

};

// 0x0 (0x560 - 0x560)
// Class FortniteGame.AIHotSpotRenderingComponent
class UAIHotSpotRenderingComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UAIHotSpotRenderingComponent* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class FortniteGame.AIHotSpotSlot
class UAIHotSpotSlot : public UObject
{
public:
	uint8                                        Pad_C03[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LocalTransform;                                    // 0x30(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        Height;                                            // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Radius;                                            // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DistanceToFocusActor;                              // 0x68(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        UserId;                                            // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartEnabled : 1;                                 // Mask: 0x1, PropSize: 0x10x70(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasCachedAgentData : 1;                           // Mask: 0x2, PropSize: 0x10x70(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasOverlappingSlots : 1;                          // Mask: 0x4, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDistanceToFocusActor : 1;                      // Mask: 0x8, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsBlockingOthers : 1;                             // Mask: 0x10, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x20, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_C6 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C04[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AAIController*                         Owner;                                             // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x80(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAIHotSpotSlot                    SlotState;                                         // 0x84(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C05[0x3B];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotSlot* GetDefaultObj();

	void SetSlotState(enum class EAIHotSpotSlot NewState);
	void SetSlotOwnerAndState(class AAIController* NewOwner, enum class EAIHotSpotSlot NewState);
	void SetSlotEnabled(bool bNewEnabled);
	void OnStateChanged(class AAIController* SlotOwner, enum class EAIHotSpotSlot NewState);
	bool IsEnabled();
	bool IsAIAllowed(class AAIController* AI);
	bool HasUserId();
	int32 GetSlotUserId();
	enum class EAIHotSpotSlot GetSlotState();
	struct FRotator GetSlotRotation();
	float GetSlotRadius();
	class AAIController* GetSlotOwner();
	struct FVector GetSlotLocation();
	int32 GetSlotIndex();
	float GetSlotHeight();
	struct FBox GetSlotBounds();
	class AAIHotSpot* GetHotSpot();
	void ClearSlot();
};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.AIHotSpotSlotGenerator
class UAIHotSpotSlotGenerator : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAIHotSpotSlotGenerator* GetDefaultObj();

	class AAIHotSpot* GetHotSpot();
	void GenerateSlots();
	class UAIHotSpotSlot* AddSlot(struct FVector& RelativeLocation, struct FRotator& RelativeRotation, TSubclassOf<class UAIHotSpotSlot> CustomSlotClass, bool bEnabled);
};

// 0x48 (0x70 - 0x28)
// Class FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox
class UAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator
{
public:
	TSubclassOf<class UAIHotSpotSlot>            SlotClass;                                         // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MaxExtent;                                         // 0x30(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExpandBy;                                          // 0x3C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OffsetFromEdge;                                    // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Spacing;                                           // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLimitMaxExtent : 1;                               // Mask: 0x1, PropSize: 0x10x48(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMustHitFocusActor : 1;                            // Mask: 0x2, PropSize: 0x10x48(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_C7 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C0F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EBoundingBoxSlotDirectionCalculation SlotDirectionCalculation;                          // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C10[0x23];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHotSpotSlotGenerator_OnBoundingBox* GetDefaultObj();

};

// 0x90 (0x440 - 0x3B0)
// Class FortniteGame.FortReplaySpectatorPawnBase
class AFortReplaySpectatorPawnBase : public ASpectatorPawn
{
public:
	class UFortSpectatorCameraComponent*         SpectatorCameraComponent;                          // 0x3B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MiniMapIconBrush;                                  // 0x3B8(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AFortReplaySpectatorPawnBase* GetDefaultObj();

};

// 0x20 (0x460 - 0x440)
// Class FortniteGame.ArenaCamPawn
class AArenaCamPawn : public AFortReplaySpectatorPawnBase
{
public:
	class AFortPlayerControllerSpectating*       SpectatorController;                               // 0x440(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortArenaCamera*>              ArenaCams;                                         // 0x448(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                        CurrArenaCamIdx;                                   // 0x458(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C14[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AArenaCamPawn* GetDefaultObj();

};

// 0xF0 (0x528 - 0x438)
// Class FortniteGame.FortAIController
class AFortAIController : public AAIController
{
public:
	uint8                                        Pad_C29[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUsingNavMesh : 1;                                 // Mask: 0x1, PropSize: 0x10x450(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysNotifyBumpWall : 1;                         // Mask: 0x2, PropSize: 0x10x450(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInstantRotation : 1;                              // Mask: 0x4, PropSize: 0x10x450(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTurnTransitionsEnabled : 1;                       // Mask: 0x8, PropSize: 0x10x450(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_C8 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C2A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortPathFollowingComponent*           FortPathFollowingComp;                             // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIHotSpotUseInfo                     CurrentHotSpot;                                    // 0x460(0x18)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        GoalInfoUpdateRate;                                // 0x478(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C2B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                GoalActor;                                         // 0x480(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GoalVisibilityPersistanceTime;                     // 0x488(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C2C[0x94];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAIPawn*                           MyFortPawn;                                        // 0x520(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AFortAIController* GetDefaultObj();

	void WakeUp();
	void UnregisterForGoalDetection();
	void UnlockMovementResource();
	void UnlockBehaviorResource();
	void SetupCustomVIM(class UClass* VIM);
	void SetTeam(enum class EFortTeam InTeam);
	void SetPawnAIType(enum class EFortressAIType NewAIType, class AActor* SpawnSpot);
	void SetIsSleeping(bool bNewSleepStatus);
	void SetGoalActor(class AActor* InActor, bool bLocationAlwaysKnown);
	void SetFullPeripheralVision(bool bNewFullPeripheralVision);
	void SetAlwaysGameplayRelevant(bool bInAlwaysGameplayRelevant);
	void OnBuildingActorGoalDestroyed();
	void LockMovementResource();
	void LockBehaviorResource();
	bool IsIgnoringProximity(class AFortAIController* FortAIController);
	bool IsAllowedToSleep();
	void IgnoreProximityForDuration(float DurationToIgnore);
	class AActor* GetGoalActor();
	class UFortAIEncounterInfo* GetEncounterInfo();
	bool CreateBuildingActor(TSubclassOf<class ABuildingSMActor> BuildingClass, const struct FVector& BuildLoc, const struct FRotator& BuildRot, bool bMirrored);
};

// 0x8 (0x530 - 0x528)
// Class FortniteGame.AthenaAIController
class AAthenaAIController : public AFortAIController
{
public:
	uint8                                        Pad_C30[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAthenaAIController* GetDefaultObj();

};

// 0x8 (0x1D0 - 0x1C8)
// Class FortniteGame.FortAIPerceptionComponent
class UFortAIPerceptionComponent : public UAIPerceptionComponent
{
public:
	float                                        LosingSightRadiusBump;                             // 0x1C8(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C31[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAIPerceptionComponent* GetDefaultObj();

};

// 0x0 (0x1D0 - 0x1D0)
// Class FortniteGame.AthenaAIPerceptionComponent
class UAthenaAIPerceptionComponent : public UFortAIPerceptionComponent
{
public:

	static class UClass* StaticClass();
	static class UAthenaAIPerceptionComponent* GetDefaultObj();

};

// 0xD0 (0x3E8 - 0x318)
// Class FortniteGame.FortPathFollowingComponent
class UFortPathFollowingComponent : public UCrowdFollowingComponent
{
public:
	class AFortAIController*                     MyAI;                                              // 0x318(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C34[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MovementBlockFrustrationCooldownSpeed;             // 0x340(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C35[0xA4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortPathFollowingComponent* GetDefaultObj();

};

// 0x0 (0x3E8 - 0x3E8)
// Class FortniteGame.AthenaPathFollowingComponent
class UAthenaPathFollowingComponent : public UFortPathFollowingComponent
{
public:

	static class UClass* StaticClass();
	static class UAthenaPathFollowingComponent* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class FortniteGame.AthenaAIPerceptionManager
class UAthenaAIPerceptionManager : public UObject
{
public:
	uint8                                        Pad_C3C[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIPerceptionManager* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.AthenaAISettings
class UAthenaAISettings : public UObject
{
public:
	uint8                                        bAllowAIDirector : 1;                              // Mask: 0x1, PropSize: 0x10x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowAIGoalManager : 1;                           // Mask: 0x2, PropSize: 0x10x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceRVOUse : 1;                                  // Mask: 0x4, PropSize: 0x10x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_C9 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C3F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinHearingRange;                                   // 0x2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHearingRange;                                   // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeAggroRange;                                      // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNavigationSystemConfig*               NavigationSystemConfig;                            // 0x38(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, AdvancedDisplay, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaAISettings* GetDefaultObj();

};

// 0x70 (0x98 - 0x28)
// Class FortniteGame.AthenaAISpawnManager
class UAthenaAISpawnManager : public UObject
{
public:
	TMap<int32, struct FAISpawnRequest>          SpawnRequests;                                     // 0x28(0x50)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C49[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        AllSpawnedActors;                                  // 0x80(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C4A[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAISpawnManager* GetDefaultObj();

	bool SpawnActors(class UObject* WorldContextObject, TSubclassOf<class AActor> ActorClass, class UEnvQuery* QueryTemplate, struct FVector& RefLocation, UDelegateProperty_ Event, float MinRadius, float MaxRadius, int32 Count);
	class UAthenaAISpawnManager* GetAISpawnManager(class UObject* WorldContextObject);
};

// 0x18 (0x40 - 0x28)
// Class FortniteGame.AthenaAIDataProvider_SpawnManager
class UAthenaAIDataProvider_SpawnManager : public UAIDataProvider
{
public:
	struct FVector                               ReferenceLocation;                                 // 0x28(0xC)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinDistance;                                       // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C4C[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIDataProvider_SpawnManager* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.AthenaQueryContext_SpawnRefLocation
class UAthenaQueryContext_SpawnRefLocation : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UAthenaQueryContext_SpawnRefLocation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteGame.AthenaAIBlueprintLibrary
class UAthenaAIBlueprintLibrary : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAthenaAIBlueprintLibrary* GetDefaultObj();

	void AggroOnActor(TArray<class AActor*>& Agents, class AActor* Target);
};

// 0x90 (0x1B8 - 0x128)
// Class FortniteGame.FortAISystem
class UFortAISystem : public UAISystem
{
public:
	TArray<class UFortQueryTwoPointSolver*>      TwoPointSolvers;                                   // 0x128(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UFortInfluenceMap*                     InfluenceMap;                                      // 0x138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBotMissionManager*                BotManager;                                        // 0x140(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C55[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortRiftBlockerComponent*>     ActiveRiftBlockers;                                // 0x158(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_C56[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAISystem* GetDefaultObj();

	bool IsInCone2D(const struct FVector& ConeOrigin, const struct FVector& ConeDirection, float HalfAngle, const struct FVector& LocationToCheck);
};

// 0x8 (0x1C0 - 0x1B8)
// Class FortniteGame.AthenaAISystem
class UAthenaAISystem : public UFortAISystem
{
public:
	class UAthenaAIPerceptionManager*            PerceptionManager;                                 // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAISystem* GetDefaultObj();

};

// 0x290 (0x2C0 - 0x30)
// Class FortniteGame.FortItemDefinition
class UFortItemDefinition : public UMcpItemDefinitionBase
{
public:
	uint8                                        Pad_C82[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemCountChanged;                                // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EFortItemType                     ItemType;                                          // 0x50(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C83[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ItemTypeNameOverride;                              // 0x58(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                        MinLevel;                                          // 0x70(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxLevel;                                          // 0x74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  DisplayName;                                       // 0x78(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	class FText                                  ShortDescription;                                  // 0x90(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  Description;                                       // 0xA8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  DisplayNamePrefix;                                 // 0xC0(0x18)(Protected, NativeAccessSpecifierProtected)
	class FText                                  SearchTags;                                        // 0xD8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 GameplayTags;                                      // 0xF0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	enum class EFortInventoryFilter              FilterOverride;                                    // 0x110(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C89[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsAccountItem : 1;                                // Mask: 0x1, PropSize: 0x10x114(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeverPersisted : 1;                               // Mask: 0x2, PropSize: 0x10x114(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_CB : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C8C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 SecondaryCategoryOverrideTags;                     // 0x118(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 TertiaryCategoryOverrideTags;                      // 0x138(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                        bAllowMultipleStacks : 1;                          // Mask: 0x1, PropSize: 0x10x158(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAutoBalanceStacks : 1;                            // Mask: 0x2, PropSize: 0x10x158(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_CD : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C8E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxStackSize;                                      // 0x15C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceAutoPickup : 1;                              // Mask: 0x1, PropSize: 0x10x160(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_CE : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C90[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bPrivateTemplate;                                  // 0x164(0x1)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInventorySizeLimited;                             // 0x165(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTemplateAccess               Access;                                            // 0x166(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCalculateRarityFromQualityAndTier;                // 0x167(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortQuality                      Quality;                                           // 0x168(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemTier                     Tier;                                              // 0x169(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortItemTier                     MaxTier;                                           // 0x16A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C96[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UFortTooltip>            TooltipClass;                                      // 0x170(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortTooltipDisplayStatsList> StatList;                                          // 0x198(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  RatingLookup;                                      // 0x1C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                            SmallPreviewImage;                                 // 0x1D0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             LargePreviewImage;                                 // 0x1D8(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortRarity                       Rarity;                                            // 0x200(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C99[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            FrontendPreviewMeshOffset;                         // 0x210(0x30)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FTransform                            AthenaFrontendPreviewMeshOffset;                   // 0x240(0x30)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UStaticMesh>            FrontendPreviewMeshOverride;                       // 0x270(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USkeletalMesh>          FrontendPreviewSkeletalMeshOverride;               // 0x298(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortItemDefinition* GetDefaultObj();

	bool ShouldShowPreviewOnCurrentHero();
	bool IsInventorySizeLimited();
	TSubclassOf<class UFortTooltip> GetTooltip();
	struct FSlateBrush GetSmallPreviewImageBrush();
	TSoftObjectPtr<class UTexture2D> GetSmallPreviewImage();
	class FText GetSingleLineDescription();
	class FText GetShortDescription();
	class FText GetRichDescription();
	enum class EFortRarity GetRarity();
	bool GetPreviewStaticMeshAsset(TSoftObjectPtr<class UStaticMesh>* Asset);
	bool GetPreviewSkeletalMeshAsset(TSoftObjectPtr<class USkeletalMesh>* Asset);
	bool GetPreviewPrefabAsset(TSoftClassPtr<class AActor>* Asset);
	struct FTransform GetPreviewMeshOffset();
	void GetPreviewAssets(TArray<TSoftObjectPtr<class UObject>>* Assets);
	class FString GetPersistentName();
	TSoftObjectPtr<class UTexture2D> GetLargePreviewImage();
	class FText GetItemTypeName(bool bUsePlural);
	enum class EFortItemType GetItemType();
	class UFortTooltipDisplayStatsList* GetDisplayStats();
	class FText GetDisplayName(bool bBaseName);
	TArray<class FText> GetDescription();
	void CustomizePreviewPrefab(class AActor* PrefabInstance);
	void CustomizePreviewMesh(class UMeshComponent* Mesh);
	class UFortItem* CreateTemporaryItemInstanceBP(int32 Count, int32 Level);
	class UFortItem* CreateTemporaryInstanceFromExistingItemBP(class UFortItem* ExistingItem, int32 Count, int32 Level);
};

// 0x70 (0x330 - 0x2C0)
// Class FortniteGame.FortAccountItemDefinition
class UFortAccountItemDefinition : public UFortItemDefinition
{
public:
	struct FCurveTableRowHandle                  LevelToXpHandle;                                   // 0x2C0(0x10)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  LevelToSacrificeXpHandle;                          // 0x2D0(0x10)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SacrificeRecipe;                                   // 0x2E0(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   TransmogSacrificeRow;                              // 0x2F0(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDataTableRowHandle>           ConversionRecipes;                                 // 0x300(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   UpgradeRarityRecipeHandle;                         // 0x310(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FString                                GrantToProfileType;                                // 0x320(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortAccountItemDefinition* GetDefaultObj();

};

// 0x58 (0x388 - 0x330)
// Class FortniteGame.AthenaCosmeticItemDefinition
class UAthenaCosmeticItemDefinition : public UFortAccountItemDefinition
{
public:
	struct FRotator                              PreviewPawnRotationOffset;                         // 0x330(0xC)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_CAA[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DisallowedCosmeticTags;                            // 0x340(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAthenaCosmeticMaterialOverride> MaterialOverrides;                                 // 0x360(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaProgressiveCosmeticType    ProgressionType;                                   // 0x370(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_CAB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortCosmeticVariant*>          ItemVariants;                                      // 0x378(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCosmeticItemDefinition* GetDefaultObj();

	bool HasVariants();
	bool HasModifiableVariants();
	class UFortCosmeticVariant* GetVariantChannel(const struct FGameplayTag& InVariantChannelTag);
	struct FRotator GetPreviewPawnRotationOffset();
	void GetDefaultVariantChannels(TArray<struct FMcpVariantChannelInfo>* OutDefaultVariantData);
};

// 0x18 (0x3A0 - 0x388)
// Class FortniteGame.AthenaCharacterPartItemDefinition
class UAthenaCharacterPartItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TArray<class UCustomCharacterPart*>          CharacterParts;                                    // 0x388(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_CAF[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCharacterPartItemDefinition* GetDefaultObj();

	TArray<class UCustomCharacterPart*> GetCharacterParts();
};

// 0x0 (0x3A0 - 0x3A0)
// Class FortniteGame.AthenaBackpackItemDefinition
class UAthenaBackpackItemDefinition : public UAthenaCharacterPartItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaBackpackItemDefinition* GetDefaultObj();

};

// 0xF8 (0x480 - 0x388)
// Class FortniteGame.AthenaBattleBusItemDefinition
class UAthenaBattleBusItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class USoundBase>             IgnitionSound;                                     // 0x388(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             LobbyLoopingMusic;                                 // 0x3B0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             LobbyLoopingSound;                                 // 0x3D8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             FlightLoopingMusic;                                // 0x400(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             FlightLoopingSound;                                // 0x428(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class ABattleBusCosmeticInstanceBase> BusPrefabClass;                                    // 0x450(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CC1[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleBusItemDefinition* GetDefaultObj();

	class USoundBase* GetLobbyLoopingSound();
	class USoundBase* GetLobbyLoopingMusic();
	class USoundBase* GetIgnitionSound();
	class USoundBase* GetFlightLoopingSound();
	class USoundBase* GetFlightLoopingMusic();
	TSubclassOf<class ABattleBusCosmeticInstanceBase> GetBusPrefabClass();
};

// 0x8 (0x390 - 0x388)
// Class FortniteGame.AthenaCallingCardItemDefinition
class UAthenaCallingCardItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                        Pad_CC3[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCallingCardItemDefinition* GetDefaultObj();

};

// 0x50 (0x78 - 0x28)
// Class FortniteGame.FortItem
class UFortItem : public UObject
{
public:
	uint8                                        Pad_D6A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemChanged;                                     // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_D6B[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnItemDestroyed;                                   // 0x58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_D6C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bLoadedFromSave : 1;                               // Mask: 0x1, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTemporaryItemOwningController : 1;                // Mask: 0x2, PropSize: 0x10x70(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D6D[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItem* GetDefaultObj();

	bool TryGetCategory(enum class EFortItemCategoryOrdinal Ordinal, class FText* OutCategoryDisplayName, bool* OutHasIcon, struct FFortMultiSizeBrush* OutCategoryIconBrush);
	void SetOwningControllerForTemporaryItem(class AFortPlayerController* InController);
	bool IsTemporaryItem();
	bool IsSlotted();
	bool IsSchematicOrCraftedWeapon();
	bool IsSchematic();
	bool IsInventoryOverflowItem();
	bool IsInStorageVault();
	bool IsEquipped();
	bool IsEquipable(class AFortPlayerController* EquippingPC, bool bGamepadSwitchingForHeroAbilities);
	bool IsDroppedItem();
	bool IsActivatable(class AFortPlayerController* FortPC, struct FGameplayTagContainer* FailureReason);
	bool HasRarityUpgrade();
	bool HasEvolutions();
	bool HasDurability();
	class FText GetUpgradeRestrictionReasonText(enum class EItemUpgradeRestrictionReason Reason);
	class UFortPersistentResourceItemDefinition* GetUpgradeResourceItemDefinition();
	int32 GetUpgradeCost();
	enum class EFortItemType GetType();
	enum class EFortItemTier GetTier();
	bool GetTertiaryCategory(class FText* ItemCategoryText, struct FSlateBrush* ItemCategoryBrush, enum class EFortBrushSize BrushSize);
	TSoftObjectPtr<class UTexture2D> GetSmallPreviewImage();
	bool GetSecondaryCategory(class FText* ItemCategoryText, struct FSlateBrush* ItemCategoryBrush, enum class EFortBrushSize BrushSize);
	class FText GetSearchTags();
	enum class EFortItemType GetSchematicResultType();
	class UFortWeaponItemDefinition* GetSchematicCraftingResultOrCraftedWeaponBP();
	class UFortItemDefinition* GetSchematicCraftingResultBP();
	int32 GetRemainingAmmo();
	int32 GetRecycleValue();
	int32 GetRating();
	struct FLinearColor GetRaritySecondaryColor();
	struct FLinearColor GetRarityColor();
	enum class EFortRarity GetRarity();
	bool GetPrimaryCategory(class FText* ItemCategoryText);
	TArray<TSoftObjectPtr<class UObject>> GetPreviewAssets();
	class AFortPlayerController* GetOwningController();
	int32 GetNumInStack();
	float GetNormalizedDurability();
	enum class EFortItemTier GetMaxTier();
	int32 GetMaxLevel();
	int32 GetLoadedAmmo();
	int32 GetLevelRelativeCostForRarityUpgrade();
	int32 GetLevel();
	TSoftObjectPtr<class UTexture2D> GetLargePreviewImage();
	class FText GetItemTypeName(bool bUsePlural);
	struct FGuid GetItemGuid();
	class UFortItemDefinition* GetItemDefinitionBP();
	enum class EFortInventoryFilter GetFilterCategory();
	class FText GetEvolveRestrictionReasonText(enum class EItemEvolutionRestrictionReason Reason);
	float GetDurability();
	class FText GetDisplayNameWithoutPrefix();
	class FText GetDisplayName();
	class FText GetDescription();
	float GetCooldownTimeRemaining(class AFortPlayerController* FortPC, float* CooldownDuration);
	TArray<struct FFortAlterationSlotStatus> GetAlterationSlots();
	TArray<class UFortAlterationItemDefinition*> GetActiveAlterations(int32 PretendLevel);
	bool DoesMatchSearchString(const class FString& SearchString);
	bool CanUpgradeItemRarity(TArray<enum class EItemEvolutionRestrictionReason>* OutRestrictionReasons);
	bool CanEvolve(TArray<enum class EItemEvolutionRestrictionReason>* OutRestrictionReasons);
	bool CanBeUpgraded(TArray<enum class EItemUpgradeRestrictionReason>* OutRestrictionReasons);
	bool CanBeUnslotted();
	bool CanBeDropped();
	bool AllowedToBeLockedInInventory();
};

// 0x68 (0xE0 - 0x78)
// Class FortniteGame.FortAccountItem
class UFortAccountItem : public UFortItem
{
public:
	int32                                        Level;                                             // 0x78(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Xp;                                                // 0x7C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Item_seen;                                         // 0x80(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Favorite;                                          // 0x84(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Max_level_bonus;                                   // 0x88(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D79[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Inventory_overflow_date;                           // 0x90(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAccountItemDefinition*            ItemDefinition;                                    // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                InstanceId;                                        // 0xA8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                TemplateId;                                        // 0xB8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        Quantity;                                          // 0xC8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsLocalOnlyItem;                                  // 0xCC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsPendingBeingMarkedAsSeen;                       // 0xCD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D7A[0x12];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAccountItem* GetDefaultObj();

	void MarkItemAsSeenBP();
	bool IsFavorite();
	bool HasBeenSeenLocally();
	TArray<struct FFortItemQuantityPair> GetRecyclingRefunds();
};

// 0x20 (0x100 - 0xE0)
// Class FortniteGame.AthenaCosmeticAccountItem
class UAthenaCosmeticAccountItem : public UFortAccountItem
{
public:
	TArray<struct FMcpVariantChannelInfo>        VariantChannels;                                   // 0xE0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantReader>             Variants;                                          // 0xF0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCosmeticAccountItem* GetDefaultObj();

	bool HasMultipleVariants();
	bool HasCosmeticVariance();
};

// 0x0 (0x100 - 0x100)
// Class FortniteGame.AthenaCharacterItem
class UAthenaCharacterItem : public UAthenaCosmeticAccountItem
{
public:

	static class UClass* StaticClass();
	static class UAthenaCharacterItem* GetDefaultObj();

};

// 0x18 (0x3A0 - 0x388)
// Class FortniteGame.AthenaCharacterItemDefinition
class UAthenaCharacterItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	class UFortHeroType*                         HeroDefinition;                                    // 0x388(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaBackpackItemDefinition*         DefaultBackpack;                                   // 0x390(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D7E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCharacterItemDefinition* GetDefaultObj();

};

// 0x60 (0x3E8 - 0x388)
// Class FortniteGame.FortMontageItemDefinitionBase
class UFortMontageItemDefinitionBase : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UAnimMontage>           Animation;                                         // 0x388(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>           AnimationFemaleOverride;                           // 0x3B0(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreviewLoops;                                      // 0x3D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EmoteCooldownSecs;                                 // 0x3DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bMontageContainsFacialAnimation;                   // 0x3E0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayRandomSection;                                // 0x3E1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D86[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortMontageItemDefinitionBase* GetDefaultObj();

	void PreviewInPIE();
	class UAnimMontage* GetAnimationHardReference(enum class EFortCustomBodyType BodyType, enum class EFortCustomGender Gender);
	TSoftObjectPtr<class UAnimMontage> GetAnimation(enum class EFortCustomBodyType BodyType, enum class EFortCustomGender Gender);
};

// 0x8 (0x3F0 - 0x3E8)
// Class FortniteGame.AthenaConsumableEmoteItemDefinition
class UAthenaConsumableEmoteItemDefinition : public UFortMontageItemDefinitionBase
{
public:
	uint8                                        Pad_D89[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaConsumableEmoteItemDefinition* GetDefaultObj();

};

// 0x20 (0x408 - 0x3E8)
// Class FortniteGame.AthenaDanceItemDefinition
class UAthenaDanceItemDefinition : public UFortMontageItemDefinitionBase
{
public:
	bool                                         bMovingEmote;                                      // 0x3E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D8C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WalkForwardSpeed;                                  // 0x3EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ChatTriggerCommandName;                            // 0x3F0(0x18)(Edit, AssetRegistrySearchable, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaDanceItemDefinition* GetDefaultObj();

	class FText GetChatTriggerCommandName();
};

// 0xB8 (0x4C0 - 0x408)
// Class FortniteGame.AthenaEmojiItemDefinition
class UAthenaEmojiItemDefinition : public UAthenaDanceItemDefinition
{
public:
	struct FGameplayTag                          EmojiGameplayCueTag;                               // 0x408(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>           PreviewAnimation;                                  // 0x410(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             SpriteSheet;                                       // 0x438(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                             SheetDimensions;                                   // 0x460(0x8)(Edit, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        FrameIndex;                                        // 0x468(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        FrameCount;                                        // 0x46C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    BaseMaterial;                                      // 0x470(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               IconSize;                                          // 0x478(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          InitialColor;                                      // 0x484(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               InitialLocation;                                   // 0x494(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               InitialVelocity;                                   // 0x4A0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifetimeIntroSeconds;                              // 0x4AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifetimeMidSeconds;                                // 0x4B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LifetimeOutroSeconds;                              // 0x4B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     GeneratedMaterial;                                 // 0x4B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaEmojiItemDefinition* GetDefaultObj();

	class UMaterialInstance* GetMaterialInstance();
	void ConfigureParticleSystem(class UParticleSystemComponent* ParticleSystem);
};

// 0x10 (0xF0 - 0xE0)
// Class FortniteGame.AthenaEventTokenItem
class UAthenaEventTokenItem : public UFortAccountItem
{
public:
	class FString                                Game_code;                                         // 0xE0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaEventTokenItem* GetDefaultObj();

};

// 0x10 (0x340 - 0x330)
// Class FortniteGame.AthenaEventTokenItemDefinition
class UAthenaEventTokenItemDefinition : public UFortAccountItemDefinition
{
public:
	enum class EEventTokenType                   TokenType;                                         // 0x330(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D90[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEventTokenItemDefinition* GetDefaultObj();

};

// 0x468 (0x728 - 0x2C0)
// Class FortniteGame.FortWorldItemDefinition
class UFortWorldItemDefinition : public UFortItemDefinition
{
public:
	struct FGameplayTagContainer                 RequiredEquipTags;                                 // 0x2C0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 OverrideAutoEquipTags;                             // 0x2E0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bCanAutoEquipByClass;                              // 0x300(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWorldItemDropBehavior            DropBehavior;                                      // 0x301(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D97[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bPersistInInventoryWhenFinalStackEmpty : 1;        // Mask: 0x1, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportsQuickbarFocus : 1;                        // Mask: 0x2, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportsQuickbarFocusForGamepadOnly : 1;          // Mask: 0x4, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldActivateWhenFocused : 1;                    // Mask: 0x8, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceFocusWhenAdded : 1;                          // Mask: 0x10, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldShowItemToast : 1;                          // Mask: 0x20, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowDirectionalArrowWhenFarOff : 1;               // Mask: 0x40, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeDropped : 1;                                 // Mask: 0x80, PropSize: 0x10x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bItemCanBeStolen : 1;                              // Mask: 0x1, PropSize: 0x10x305(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeDepositedInStorageVault : 1;                 // Mask: 0x2, PropSize: 0x10x305(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bItemHasDurability : 1;                            // Mask: 0x4, PropSize: 0x10x305(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D6 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D9C[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DropCount;                                         // 0x308(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowedToBeLockedInInventory : 1;                 // Mask: 0x1, PropSize: 0x10x30C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D7 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D9D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EFortReplicatedStat               AccumulatingStatType;                              // 0x310(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D9F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           MiniMapIconBrush;                                  // 0x318(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                        MiniMapViewableDistance;                           // 0x3A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DA0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OwnerPickupText;                                   // 0x3A8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDataTableCategoryHandle              LootLevelData;                                     // 0x3C0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_DA1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            PickupMeshTransform;                               // 0x3E0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        bOverridePickupMeshTransform : 1;                  // Mask: 0x1, PropSize: 0x10x410(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D8 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_DA4[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  PickupSpecialActorUniqueID;                        // 0x418(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           PickupMinimapIconBrush;                            // 0x420(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             PickupMinimapIconScale;                            // 0x4A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  InventorySpecialActorUniqueID;                     // 0x4B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                           InventoryMinimapIconBrush;                         // 0x4B8(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             InventoryMinimapIconScale;                         // 0x540(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisplayPlayerNameForInventoryActor;               // 0x548(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DA7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  InventoryActorDisplayName;                         // 0x550(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bDisplayHealthForInventoryActor;                   // 0x568(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisplayShieldForInventoryActor;                   // 0x569(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DAA[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSpecialActorSingleStatData>   SpecialActorPickupStatList;                        // 0x570(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSpecialActorSingleStatData>   SpecialActorInventoryStatList;                     // 0x580(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FScalableFloat                        PickupDespawnTime;                                 // 0x590(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FScalableFloat                        InStormPickupDespawnTime;                          // 0x5B8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                        bDropOnDeath : 1;                                  // Mask: 0x1, PropSize: 0x10x5E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDropOnLogout : 1;                                 // Mask: 0x2, PropSize: 0x10x5E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D9 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_DAC[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScalableFloat                        NetworkCullDistanceOverride;                       // 0x5E8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            PickupStaticMesh;                                  // 0x610(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USkeletalMesh>          PickupSkeletalMesh;                                // 0x638(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class AFortPickupEffect>       PickupEffectOverride;                              // 0x660(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             PickupSound;                                       // 0x688(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             DropSound;                                         // 0x6B0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             DroppedLoopSound;                                  // 0x6D8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DisassembleRecipe;                                 // 0x700(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        DisassembleDurabilityDegradeMinLootPercent;        // 0x710(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DisassembleDurabilityDegradeMaxLootPercent;        // 0x714(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasDisintegrationValue;                           // 0x718(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUsesCraftingRecipeToGetDisintegrationValue;       // 0x719(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DAE[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FabricationValueOverride;                          // 0x71C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PreferredQuickbarSlot;                             // 0x720(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DAF[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortWorldItemDefinition* GetDefaultObj();

	float GetMaxDurability(int32 ItemLevel);
	int32 GetFabricationValue(bool bUseDisintegrationOverride);
	float GetDPSAtLevel(int32 ItemLevel);
	float GetDamageAtLevel(int32 ItemLevel);
	class UFortWorldItemDefinition* GetAmmoWorldItemDefinition_BP();
	bool CanBeDisassembled();
};

// 0x148 (0x870 - 0x728)
// Class FortniteGame.FortGadgetItemDefinition
class UFortGadgetItemDefinition : public UFortWorldItemDefinition
{
public:
	uint8                                        Pad_DC0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UCustomCharacterPart*>          CharacterParts;                                    // 0x730(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortAnimInstance>         AnimBPOverride;                                    // 0x740(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortFootstepAudioBank*                FootstepBankOverride;                              // 0x748(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortAbilitySet>        AbilitySet;                                        // 0x750(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAttributeSet>             AttributeSet;                                      // 0x778(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAttributeInitializationKey       AttributeInitKey;                                  // 0x780(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayAttribute>            TrackedAttributes;                                 // 0x790(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bDestroyGadgetWhenTrackedAttributesIsZero;         // 0x7A0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC4[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystem*                       OnDestroyParticleSystem;                           // 0x7A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                            OnDestroySound;                                    // 0x7B0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  OnDestroyAttachToSocketName;                       // 0x7B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UFortGameplayAbility>    GameplayAbility;                                   // 0x7C0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasChargeUp;                                      // 0x7E8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDropAllOnEquip;                                   // 0x7E9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC7[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 HUDVisibilityTags;                                 // 0x7F0(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortDecoItemDefinition> DecoItemDefinition;                                // 0x810(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayAttribute                    LevelAttribute;                                    // 0x838(0x20)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   DamageStatHandle;                                  // 0x858(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bCanChangePreviewImageDuringGame;                  // 0x868(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC9[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortGadgetItemDefinition* GetDefaultObj();

	bool HasChargeUp();
	struct FGameplayAttribute GetLevelAttribute();
	TSubclassOf<class UFortGameplayAbility> GetGameplayAbility();
	class UFortDecoItemDefinition* GetDecoItemDefinition();
};

// 0x0 (0x870 - 0x870)
// Class FortniteGame.AthenaGadgetItemDefinition
class UAthenaGadgetItemDefinition : public UFortGadgetItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaGadgetItemDefinition* GetDefaultObj();

};

// 0x58 (0x80 - 0x28)
// Class FortniteGame.FortTooltipManager
class UFortTooltipManager : public UObject
{
public:
	TMap<class UClass*, class UFortTooltip*>     Tooltips;                                          // 0x28(0x50)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AActor*                                DamageRecieverProxy;                               // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortTooltipManager* GetDefaultObj();

};

// 0x68 (0x90 - 0x28)
// Class FortniteGame.FortTooltip
class UFortTooltip : public UObject
{
public:
	class FText                                  Description;                                       // 0x28(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_DEE[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortTooltip* GetDefaultObj();

	void SetLocalizationText(const class FString& Name, class FText Value);
	void SetLocalizationInt(const class FString& Name, int32 Value);
	void SetLocalizationFloat(const class FString& Name, float Value);
	bool GetValueData(class UObject* ObjectToDescribe, class UFortTooltipContext* Context, struct FGameplayTag& Token, struct FFortTooltipValueData* OutData);
	bool GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
	bool BP_GetValueData(class UObject* ObjectToDescribe, class UFortTooltipContext* Context, struct FGameplayTag& Token, struct FFortTooltipValueData* OutData);
	bool BP_GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool BP_GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool BP_GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
};

// 0x0 (0x90 - 0x90)
// Class FortniteGame.FortItemDefinitionTooltip
class UFortItemDefinitionTooltip : public UFortTooltip
{
public:

	static class UClass* StaticClass();
	static class UFortItemDefinitionTooltip* GetDefaultObj();

	bool GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
};

// 0x0 (0x90 - 0x90)
// Class FortniteGame.FortWorldItemDefinitionTooltip
class UFortWorldItemDefinitionTooltip : public UFortItemDefinitionTooltip
{
public:

	static class UClass* StaticClass();
	static class UFortWorldItemDefinitionTooltip* GetDefaultObj();

	bool GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
};

// 0x0 (0x90 - 0x90)
// Class FortniteGame.AthenaGadgetItemDefinitionTooltip
class UAthenaGadgetItemDefinitionTooltip : public UFortWorldItemDefinitionTooltip
{
public:

	static class UClass* StaticClass();
	static class UAthenaGadgetItemDefinitionTooltip* GetDefaultObj();

	bool GetTokenizedDescriptionText(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, TArray<class FText>* OutDescription);
	bool GetTextForToken(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, class FText* OutText);
	bool GetNumericValue(class UObject* ObjectToDescribe, struct FGameplayTag& Tag, class UFortTooltipContext* Context, struct FGameplayTag& Token, float* OutVal);
};

// 0x210 (0x240 - 0x30)
// Class FortniteGame.AthenaGameData
class UAthenaGameData : public UPrimaryDataAsset
{
public:
	class UFortPersistentResourceItemDefinition* SoftCurrencyDefinition;                            // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPersistentResourceItemDefinition* SeasonXPDefinition;                                // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAthenaPickaxeItemDefinition> FallbackPickaxe;                                   // 0x40(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAthenaDanceItemDefinition> FallbackDance;                                     // 0x68(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaSeasonItemDefinition*           FallbackSeason;                                    // 0x90(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaBattleBusItemDefinition*        DefaultBattleBusSkin;                              // 0x98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaGliderItemDefinition*           DefaultGliderSkin;                                 // 0xA0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAthenaSkyDiveContrailItemDefinition*  DefaultContrailEffect;                             // 0xA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCosmeticItemMarkupTable*          CosmeticMarkupTable;                               // 0xB0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>             CosmeticPreviewActionList;                         // 0xB8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortEmotePreviewActor>  EmotePreviewActorClass;                            // 0xE0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortLoadingScreenPreviewActor> LoadingScreenPreviewActorClass;                    // 0x108(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortSprayPreviewActor>  SprayPreviewActorClass;                            // 0x130(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortSkyDiveContrailPreviewActor> SkyDiveContrailPreviewActorClass;                  // 0x158(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AFortBodyPartOverridePreviewActor> BodyPartOverridePreviewActorClass;                 // 0x180(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EAthenaCustomizationCategory, TSoftClassPtr<class AActor>> CosmeticPreviewActionMap;                          // 0x1A8(0x50)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UAthenaCharacterItemDefinition*> RandomCharacters;                                  // 0x1F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTagMessage>           UnableToPerformActionMessages;                     // 0x208(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                     TimeOfDayRGBForPeripherals;                        // 0x218(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundMix*                             AthenaSoundMix;                                    // 0x220(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraAnim*                           DroneCameraAnim;                                   // 0x228(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraAnim*                           ThirdPersonCameraAnim;                             // 0x230(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraAnim*                           ArenaCameraAnim;                                   // 0x238(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaGameData* GetDefaultObj();

};

// 0x0 (0x100 - 0x100)
// Class FortniteGame.AthenaGliderItem
class UAthenaGliderItem : public UAthenaCosmeticAccountItem
{
public:

	static class UClass* StaticClass();
	static class UAthenaGliderItem* GetDefaultObj();

};

// 0x138 (0x4C0 - 0x388)
// Class FortniteGame.AthenaGliderItemDefinition
class UAthenaGliderItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	enum class EFortGliderType                   GliderType;                                        // 0x388(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E10[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AFortPlayerParachute>    ParachutePrefabClass;                              // 0x390(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USkeletalMesh>          SkeletalMesh;                                      // 0x3B8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UAnimInstance>           AnimClass;                                         // 0x3E0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UParticleSystem>        TrailParticles;                                    // 0x408(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UParticleSystem>        OwnerTrailParticles;                               // 0x430(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bActivateTrailsOnRotationalMovement;               // 0x458(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E13[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  TrailParamName;                                    // 0x460(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             OpenSound;                                         // 0x468(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>             CloseSound;                                        // 0x490(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E15[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGliderItemDefinition* GetDefaultObj();

	TSubclassOf<class AFortPlayerParachute> GetParachutePrefabClass();
};

// 0x0 (0x3A0 - 0x3A0)
// Class FortniteGame.AthenaHatItemDefinition
class UAthenaHatItemDefinition : public UAthenaCharacterPartItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaHatItemDefinition* GetDefaultObj();

};

// 0x48 (0x3D0 - 0x388)
// Class FortniteGame.AthenaLoadingScreenItemDefinition
class UAthenaLoadingScreenItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UTexture2D>             BackgroundImage;                                   // 0x388(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             BackgroundDesiredSize;                             // 0x3B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          BackgroundColor;                                   // 0x3B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E1A[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenItemDefinition* GetDefaultObj();

};

// 0x28 (0x3B0 - 0x388)
// Class FortniteGame.AthenaMapMarkerItemDefinition
class UAthenaMapMarkerItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftClassPtr<class AFortMapMarkerTopperActor> TopperActorClass;                                  // 0x388(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaMapMarkerItemDefinition* GetDefaultObj();

};

// 0x8 (0x390 - 0x388)
// Class FortniteGame.AthenaMusicOverrideItemDefinition
class UAthenaMusicOverrideItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                        Pad_E1E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMusicOverrideItemDefinition* GetDefaultObj();

};

// 0x1F8 (0x608 - 0x410)
// Class FortniteGame.FortNavSystem
class UFortNavSystem : public UNavigationSystemV1
{
public:
	uint8                                        Pad_E24[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UNavArea>                DefaultSmashableArea;                              // 0x420(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownArea;                                      // 0x448(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownSmashableArea;                             // 0x470(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownSmashableArea2;                            // 0x498(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                JumpDownSmashableArea3;                            // 0x4C0(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARecastNavMesh*>                NamedNavmeshes;                                    // 0x4E8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UFortNavLinkBlockerComponent*>  NavLinkBlockers;                                   // 0x4F8(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_E26[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortPathCostEstimator*>        PathEstimators;                                    // 0x518(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UFortInescapableZoneTracker*>   InescapableZones;                                  // 0x528(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        bUseStaticMeshLinks : 1;                           // Mask: 0x1, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseStaticWorldLinksDown : 1;                      // Mask: 0x2, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseStaticWorldLinksUp : 1;                        // Mask: 0x4, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseJumpLinkActors : 1;                            // Mask: 0x8, PropSize: 0x10x538(0x1)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_DF : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E27[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DirtyAreasUpdateFreqInactive;                      // 0x53C(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E28[0x90];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortNavigationGraph*                  NavGraphData;                                      // 0x5D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        CompositePathGoals;                                // 0x5D8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBox>                          AtlasCells;                                        // 0x5E8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_E2A[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortNavSystem* GetDefaultObj();

	void OnNavDataRegistered(class ANavigationData* NavData);
	bool IsNavmeshInRadiusInitialized(class UObject* WorldContext, struct FVector& TestLocation, float TestRadius);
};

// 0x10 (0x618 - 0x608)
// Class FortniteGame.AthenaNavSystem
class UAthenaNavSystem : public UFortNavSystem
{
public:
	uint8                                        bUseBuildingGridAsNavigableSpace : 1;              // Mask: 0x1, PropSize: 0x10x608(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_E0 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E2C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaAISpawnManager*                 SpawnManager;                                      // 0x610(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaNavSystem* GetDefaultObj();

};

// 0x18 (0x68 - 0x50)
// Class FortniteGame.AthenaNavSystemConfig
class UAthenaNavSystemConfig : public UNavigationSystemModuleConfig
{
public:
	TArray<struct FNavDataConfig>                SupportedAgents;                                   // 0x50(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        bUseBuildingGridAsNavigableSpace : 1;              // Mask: 0x1, PropSize: 0x10x60(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDiscardNavDataFromSublevels : 1;                  // Mask: 0x2, PropSize: 0x10x60(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E2F[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaNavSystemConfig* GetDefaultObj();

};

// 0x8 (0x390 - 0x388)
// Class FortniteGame.AthenaPickaxeItemDefinition
class UAthenaPickaxeItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	class UFortWeaponMeleeItemDefinition*        WeaponDefinition;                                  // 0x388(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaPickaxeItemDefinition* GetDefaultObj();

};

// 0xB0 (0xD8 - 0x28)
// Class FortniteGame.AthenaStatsSet
class UAthenaStatsSet : public UObject
{
public:
	struct FAthenaMatchStats                     CumulativeStats;                                   // 0x28(0xA0)(NativeAccessSpecifierPublic)
	TArray<struct FAthenaMatchStats>             BestMatches;                                       // 0xC8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaStatsSet* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class FortniteGame.AthenaSeasonStats
class UAthenaSeasonStats : public UObject
{
public:
	class UAthenaStatsSet*                       CumulativeStats;                                   // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UAthenaStatsSet*>    Buckets;                                           // 0x30(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAthenaSeasonItemDefinition*           SeasonDefinition;                                  // 0x80(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSeasonStats* GetDefaultObj();

	class UAthenaSeasonItemDefinition* GetSeasonDefintion();
};

// 0x168 (0x190 - 0x28)
// Class FortniteGame.AthenaPlayerMatchReport
class UAthenaPlayerMatchReport : public UObject
{
public:
	UMulticastDelegateProperty_                  OnRewardsAvailable;                                // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnStatsAvailable;                                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTeamStatsAvailable;                              // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FAthenaLevelInfo                      InitialLevelInfo;                                  // 0x58(0x24)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasMatchStats;                                    // 0x7C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E44[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaMatchStats                     MatchStats;                                        // 0x80(0xA0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bHasTeamStats;                                     // 0x120(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E45[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaMatchTeamStats                 TeamStats;                                         // 0x124(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasRewards;                                       // 0x12C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E46[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaRewardResult                   EndOfMatchResults;                                 // 0x130(0x40)(NativeAccessSpecifierPublic)
	struct FAthenaTravelRecord                   TravelRecord;                                      // 0x170(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  TravelLogUpdated;                                  // 0x180(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaPlayerMatchReport* GetDefaultObj();

	void GetXpRewards(TArray<struct FAthenaMatchXpReward>* XpRewards);
	int32 GetTotalSeasonalXpEarned();
	int32 GetTotalScoreEarned();
	int32 GetTotalBookXpEarned();
	void GetLootRewards(TArray<struct FAthenaMatchLootReward>* LootRewards);
	void DataAvailableEvent__DelegateSignature();
};

// 0x10 (0x40 - 0x30)
// Class FortniteGame.AthenaQuickChatBank
class UAthenaQuickChatBank : public UDataAsset
{
public:
	TArray<struct FAthenaQuickChatLeafEntry>     ChatOptions;                                       // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaQuickChatBank* GetDefaultObj();

};

// 0x18 (0x348 - 0x330)
// Class FortniteGame.FortEventItemDefinitionBase
class UFortEventItemDefinitionBase : public UFortAccountItemDefinition
{
public:
	int32                                        EventPriority;                                     // 0x330(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bActivateByDefault;                                // 0x334(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E4C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RequiredEventTag;                                  // 0x338(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  DisallowedEventTag;                                // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortEventItemDefinitionBase* GetDefaultObj();

	void CreateCalendarPayload();
};

// 0x38 (0x380 - 0x348)
// Class FortniteGame.AthenaSeasonalDecorEvent
class UAthenaSeasonalDecorEvent : public UFortEventItemDefinitionBase
{
public:
	TSoftClassPtr<class AFortAthenaSupplyDrop>   SupplyDropOverride;                                // 0x348(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceBattleBusOverrideEvenIfCosmeticSlotted;      // 0x370(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E50[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBattleBusItemDefinition*        BattleBusOverride;                                 // 0x378(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSeasonalDecorEvent* GetDefaultObj();

};

// 0xE0 (0x410 - 0x330)
// Class FortniteGame.AthenaSeasonItemDefinition
class UAthenaSeasonItemDefinition : public UFortAccountItemDefinition
{
public:
	int32                                        SeasonNumber;                                      // 0x330(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumSeasonLevels;                                   // 0x334(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumBookLevels;                                     // 0x338(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E52[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            SeasonXpCurve;                                     // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            BookXpCurve;                                       // 0x348(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaSeasonShopVisibility       SeasonShopVisibility;                              // 0x350(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAthenaChallengeTabVisibility     ChallengesVisibility;                              // 0x351(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E54[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SeasonStorefront;                                  // 0x358(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                BattlePassLevelOfferID;                            // 0x368(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAthenaRewardSchedule                 SeasonXpScheduleFree;                              // 0x378(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAthenaRewardSchedule                 BookXpScheduleFree;                                // 0x388(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAthenaRewardSchedule                 BookXpSchedulePaid;                                // 0x398(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAthenaSeasonBannerLevelSchedule      SeasonBannerSchedule;                              // 0x3A8(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	class UFortChallengeBundleScheduleDefinition* ChallengeSchedulePaid;                             // 0x3B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortChallengeBundleScheduleDefinition*> ChallengeSchedulesAlwaysShown;                     // 0x3C0(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAthenaRewardScheduleLevel            SeasonFirstWinRewards;                             // 0x3D0(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAthenaRewardScheduleLevel            BattleStarSubstitutionReward;                      // 0x3E0(0x10)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> ExpiringRewardTypes;                               // 0x3F0(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> TokensToRemoveAtSeasonEnd;                         // 0x400(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaSeasonItemDefinition* GetDefaultObj();

};

// 0x0 (0x330 - 0x330)
// Class FortniteGame.AthenaSeasonTreasureItemDefinition
class UAthenaSeasonTreasureItemDefinition : public UFortAccountItemDefinition
{
public:

	static class UClass* StaticClass();
	static class UAthenaSeasonTreasureItemDefinition* GetDefaultObj();

};

// 0x28 (0x3B0 - 0x388)
// Class FortniteGame.AthenaSkyDiveContrailItemDefinition
class UAthenaSkyDiveContrailItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	TSoftObjectPtr<class UParticleSystem>        ContrailEffect;                                    // 0x388(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaSkyDiveContrailItemDefinition* GetDefaultObj();

};

// 0x80 (0xA8 - 0x28)
// Class FortniteGame.AthenaSpectatorPlayerListRowData
class UAthenaSpectatorPlayerListRowData : public UObject
{
public:
	UMulticastDelegateProperty_                  OnIsSpectatorTargetChanged;                        // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnKillsChanged;                                    // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        Rank;                                              // 0x48(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TeamNumber;                                        // 0x4C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          TeamColor;                                         // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x60(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Kills;                                             // 0x70(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRecordingPlayer;                                 // 0x74(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsSpectatorTarget;                                 // 0x75(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E6C[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                      PlayerUniqueId;                                    // 0x80(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorPlayerListRowData* GetDefaultObj();

	void SetKills(int32 InKills);
	class AFortPlayerStateAthena* GetPlayerState();
};

// 0x68 (0x90 - 0x28)
// Class FortniteGame.AthenaSpectatorScoreboardRowData
class UAthenaSpectatorScoreboardRowData : public UObject
{
public:
	int32                                        Rank;                                              // 0x28(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowPlayerNumber;                                 // 0x2C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E74[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TeamNumber;                                        // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlayerNumber;                                      // 0x34(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          TeamColor;                                         // 0x38(0x10)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x48(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Kills;                                             // 0x58(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EScoreboardState                  ScoreboardState;                                   // 0x5C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsRecordingPlayer;                                // 0x5D(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsSpectatorTarget;                                // 0x5E(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E78[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerStateAthena*                PlayerState;                                       // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                      PlayerUniqueId;                                    // 0x68(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaSpectatorScoreboardRowData* GetDefaultObj();

	class AFortPlayerStateAthena* GetPlayerState();
};

// 0x68 (0x470 - 0x408)
// Class FortniteGame.AthenaSprayItemDefinition
class UAthenaSprayItemDefinition : public UAthenaDanceItemDefinition
{
public:
	TSoftObjectPtr<class UMaterialInterface>     DecalMaterial;                                     // 0x408(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ProgressiveCosmeticStatName;                       // 0x430(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseBannerAsTexture;                               // 0x438(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             DecalTexture;                                      // 0x440(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7D[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSprayItemDefinition* GetDefaultObj();

	bool ShouldUseBannerAsTexture();
	TSoftObjectPtr<class UTexture2D> GetDecalTexture();
	TSoftObjectPtr<class UMaterialInterface> GetDecalMaterial();
};

// 0x58 (0x460 - 0x408)
// Class FortniteGame.AthenaToyItemDefinition
class UAthenaToyItemDefinition : public UAthenaDanceItemDefinition
{
public:
	TSoftClassPtr<class UFortGameplayAbility>    ToySpawnAbility;                                   // 0x408(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class AFortToyActorBase>       FrontEndPreviewActor;                              // 0x430(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E7E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaToyItemDefinition* GetDefaultObj();

};

// 0x78 (0x400 - 0x388)
// Class FortniteGame.AthenaVehicleCosmeticItemDefinition
class UAthenaVehicleCosmeticItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	enum class EFortVehicleDecoType              DecoType;                                          // 0x388(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E80[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DecoSocketName;                                    // 0x390(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E81[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            DecoSocketTransform;                               // 0x3A0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            TestDecoMesh;                                      // 0x3D0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E84[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaVehicleCosmeticItemDefinition* GetDefaultObj();

};

// 0x8 (0x3F0 - 0x3E8)
// Class FortniteGame.AthenaVictoryPoseItemDefinition
class UAthenaVictoryPoseItemDefinition : public UFortMontageItemDefinitionBase
{
public:
	uint8                                        Pad_E87[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaVictoryPoseItemDefinition* GetDefaultObj();

};

// 0x18 (0x360 - 0x348)
// Class FortniteGame.AthenaWeaponAlterationEvent
class UAthenaWeaponAlterationEvent : public UFortEventItemDefinitionBase
{
public:
	TArray<struct FAthenaWeaponAlterationRule>   AlterationRules;                                   // 0x348(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bStopAfterFirstMatch;                              // 0x358(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowPlayerCosmeticWeaponSkins;                   // 0x359(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E8B[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaWeaponAlterationEvent* GetDefaultObj();

};

// 0x8 (0x390 - 0x388)
// Class FortniteGame.AthenaWeaponCosmeticItemDefinition
class UAthenaWeaponCosmeticItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                        Pad_E8D[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaWeaponCosmeticItemDefinition* GetDefaultObj();

};

// 0x188 (0x4B0 - 0x328)
// Class FortniteGame.TimeOfDayController_BlueprintBase
class ATimeOfDayController_BlueprintBase : public AActor
{
public:
	uint8                                        bOverride_FogCutoffDistance : 1;                   // Mask: 0x1, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDensity : 1;                          // Mask: 0x2, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogHeightFalloff : 1;                    // Mask: 0x4, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogInscatteringColor : 1;                // Mask: 0x8, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogMaxOpacity : 1;                       // Mask: 0x10, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogStartDistance : 1;                    // Mask: 0x20, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDirectionalInscatteringColor : 1;     // Mask: 0x40, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDirectionalInscatteringExponent : 1;  // Mask: 0x80, PropSize: 0x10x328(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogDirectionalInscatteringStartDistance : 1; // Mask: 0x1, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogFullyDirectionalInscatteringColorDistance : 1; // Mask: 0x2, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogUseVolumetricFog : 1;                 // Mask: 0x4, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogExtinctionScale : 1;     // Mask: 0x8, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogDistance : 1;            // Mask: 0x10, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogScatteringDistribution : 1; // Mask: 0x20, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_FogVolumetricFogAlbedo : 1;              // Mask: 0x40, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_TimeOfDay : 1;                           // Mask: 0x80, PropSize: 0x10x329(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_PostProcessBlendWeight : 1;              // Mask: 0x1, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_PostProcessFogOpacity : 1;               // Mask: 0x2, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_PostProcessFogColor : 1;                 // Mask: 0x4, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_DirectionalLightColor : 1;               // Mask: 0x8, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_DirectionalLightIntensity : 1;           // Mask: 0x10, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_DirectionalLightAngle : 1;               // Mask: 0x20, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyboxHorizonColor : 1;                  // Mask: 0x40, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyboxZenithColor : 1;                   // Mask: 0x80, PropSize: 0x10x32A(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudAmountHorizon : 1;                  // Mask: 0x1, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudAmountZenith : 1;                   // Mask: 0x2, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudSpeedMaster : 1;                    // Mask: 0x4, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudSpeedDetailTextureOne : 1;          // Mask: 0x8, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_CloudSpeedDetailTextureTwo : 1;          // Mask: 0x10, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_StormStrength : 1;                       // Mask: 0x20, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SunScale : 1;                            // Mask: 0x40, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SunDiscIntensity : 1;                    // Mask: 0x80, PropSize: 0x10x32B(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyLightColor : 1;                       // Mask: 0x1, PropSize: 0x10x32C(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyLightIntensity : 1;                   // Mask: 0x2, PropSize: 0x10x32C(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverride_SkyLightCubemap : 1;                     // Mask: 0x4, PropSize: 0x10x32C(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_E3 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_E9D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FogCutoffDistance;                                 // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogDensity;                                        // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogHeightFalloff;                                  // 0x338(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          FogInscatteringColor;                              // 0x33C(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogMaxOpacity;                                     // 0x34C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogStartDistance;                                  // 0x350(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          FogDirectionalInscatteringColor;                   // 0x354(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogDirectionalInscatteringExponent;                // 0x364(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogDirectionalInscatteringStartDistance;           // 0x368(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogFullyDirectionalInscatteringColorDistance;      // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         FogUseVolumetricFog;                               // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E9F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FogVolumetricFogExtinctionScale;                   // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogVolumetricFogDistance;                          // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FogVolumetricFogScatteringDistribution;            // 0x37C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                FogVolumetricFogAlbedo;                            // 0x380(0x4)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeOfDay;                                         // 0x384(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PostProcessBlendWeight;                            // 0x388(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PostProcessFogOpacity;                             // 0x38C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          PostProcessFogColor;                               // 0x390(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          DirectionalLightColor;                             // 0x3A0(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DirectionalLightIntensity;                         // 0x3B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               DirectionalLightAngle;                             // 0x3B4(0xC)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          SkyboxHorizonColor;                                // 0x3C0(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          SkyboxZenithColor;                                 // 0x3D0(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudAmountHorizon;                                // 0x3E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudAmountZenith;                                 // 0x3E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudSpeedMaster;                                  // 0x3E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudSpeedDetailTextureOne;                        // 0x3EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CloudSpeedDetailTextureTwo;                        // 0x3F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormStrength;                                     // 0x3F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SunScale;                                          // 0x3F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SunDiscIntensity;                                  // 0x3FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, float>                     ScalarParameters;                                  // 0x400(0x50)(Edit, BlueprintVisible, ZeroConstructor, Interp, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          SkyboxHorizonMaterialParameters;                   // 0x450(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          SkyboxZenithMaterialParameters;                    // 0x460(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FLinearColor                          SkyLightColor;                                     // 0x470(0x10)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SkyLightIntensity;                                 // 0x480(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EA2[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextureCube*                          SkyLightCubemap;                                   // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortTimeOfDayManager*                 TODM;                                              // 0x490(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExponentialHeightFogComponent*        ExponentialHeightFog;                              // 0x498(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDirectionalLightComponent*            DirectionalLight;                                  // 0x4A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkyLightComponent*                    SkyLight;                                          // 0x4A8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ATimeOfDayController_BlueprintBase* GetDefaultObj();

	void SetSunOrMoonScale();
	void SetPostProcessSettings();
};

// 0x28 (0x468 - 0x440)
// Class FortniteGame.HoverDronePawn
class AHoverDronePawn : public AFortReplaySpectatorPawnBase
{
public:
	uint8                                        Pad_EA9[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHoverDroneMovementComponent*          HoverMoveComponent;                                // 0x458(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EAA[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AHoverDronePawn* GetDefaultObj();

	bool IsMaintainingConstantAltitude();
	float GetAltitude();
};

// 0x80 (0x4E8 - 0x468)
// Class FortniteGame.AutoFrameDronePawn
class AAutoFrameDronePawn : public AHoverDronePawn
{
public:
	uint8                                        Pad_EAC[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        ActorsToTrack;                                     // 0x480(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class AActor*, float>                   TrackedActorTimes;                                 // 0x490(0x50)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_EAD[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAutoFrameDronePawn* GetDefaultObj();

};

// 0x80 (0xA8 - 0x28)
// Class FortniteGame.AutomationPerfMonitorManager
class UAutomationPerfMonitorManager : public UObject
{
public:
	uint8                                        Pad_EB2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        DesiredStats;                                      // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bRecording;                                        // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EB3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeSinceLastRecord;                               // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastGoodFrame;                                     // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EB4[0x5C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAutomationPerfMonitorManager* GetDefaultObj();

	void StopRecordingFTestPerf();
	void StartRecordingFTestPerf(const TArray<class FString>& StatsToRecord);
	bool IsRecordingFTestPerf();
	float GetStatAverage(const class FString& StatName);
	class UAutomationPerfMonitorManager* GetPerfMonitorInstance();
};

// 0x10 (0x338 - 0x328)
// Class FortniteGame.BattleBusCosmeticInstanceBase
class ABattleBusCosmeticInstanceBase : public AActor
{
public:
	uint8                                        Pad_EB6[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBattleBusItemDefinition*        ActiveSkin;                                        // 0x330(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABattleBusCosmeticInstanceBase* GetDefaultObj();

};

// 0x2B8 (0x5E0 - 0x328)
// Class FortniteGame.BuildingActor
class ABuildingActor : public AActor
{
public:
	uint8                                        Pad_EFA[0x68];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 MyGuid;                                            // 0x390(0x10)(Net, DuplicateTransient, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  InteractionText;                                   // 0x3A0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        OwnerPersistentID;                                 // 0x3B8(0x4)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SavedHealthPct;                                    // 0x3BC(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  DisplayName;                                       // 0x3C0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavArea>                AreaClass;                                         // 0x3D8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UNavLinkDefinition>      NavigationLinksClass;                              // 0x400(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EFC[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentBuildingLevel;                              // 0x438(0x4)(Edit, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaximumBuildingLevel;                              // 0x43C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortBuildingActorSet>     BuildingAttributeSetClass;                         // 0x440(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBuildingActorSet*                 BuildingAttributeSet;                              // 0x448(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortAttributeInitializationKey       AttributeInitKey;                                  // 0x450(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	enum class EAttributeInitLevelSource         AttributeInitLevelSource;                          // 0x460(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAbilitySystemComponentCreationPolicy AbilitySystemComponentCreationPolicy;              // 0x461(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPhysicalSurface                  PrimarySurfaceType;                                // 0x462(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBaseWeaponDamage             WeaponResponseType;                                // 0x463(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LifespanAfterDeath;                                // 0x464(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAbilitySystemComponent*           AbilitySystemComponent;                            // 0x468(0x8)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayCueParameters>        PendingDamageImpactCues;                           // 0x470(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bUseFortHealthBarIndicator;                        // 0x480(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EFF[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HealthBarIndicatorWidth;                           // 0x484(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HealthBarIndicatorVerticalOffset;                  // 0x488(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F00[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortHealthBarIndicator*               HealthBarIndicator;                                // 0x490(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        HealthBarIndicatorDifficultyRating;                // 0x498(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F01[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 ConstTags;                                         // 0x4A0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 StaticGameplayTags;                                // 0x4C0(0x20)(Protected, NativeAccessSpecifierProtected)
	enum class EDynamicBuildingPlacementType     DynamicBuildingPlacementType;                      // 0x4E0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavigationObstacleOverride       NavigationObstacleOverride;                        // 0x4E1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsInvulnerable : 1;                               // Mask: 0x1, PropSize: 0x10x4E2(0x1)(BlueprintVisible, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasRegisteredActorStateAtLeastOnce : 1;           // Mask: 0x2, PropSize: 0x10x4E2(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDirtyForLevelRecordSave : 1;                      // Mask: 0x4, PropSize: 0x10x4E2(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSavedMetaPropertiesProcessed : 1;                 // Mask: 0x8, PropSize: 0x10x4E2(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUpgradeUsesSameClass : 1;                         // Mask: 0x10, PropSize: 0x10x4E2(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDisplayLevelInInfoWidget : 1;                     // Mask: 0x20, PropSize: 0x10x4E2(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAllowUpgradeRegardlessOfPlayerBuildLevel : 1;     // Mask: 0x40, PropSize: 0x10x4E2(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSurpressHealthBar : 1;                            // Mask: 0x80, PropSize: 0x10x4E2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCreateVerboseHealthLogs : 1;                      // Mask: 0x1, PropSize: 0x10x4E3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsIndestructibleForTargetSelection : 1;           // Mask: 0x2, PropSize: 0x10x4E3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyed : 1;                                    // Mask: 0x4, PropSize: 0x10x4E3(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPersistToWorld : 1;                               // Mask: 0x8, PropSize: 0x10x4E3(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRefreshFullSaveDataBeforeZoneSave : 1;            // Mask: 0x10, PropSize: 0x10x4E3(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBeingDragged : 1;                                 // Mask: 0x20, PropSize: 0x10x4E3(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRotateInPlaceGame : 1;                            // Mask: 0x40, PropSize: 0x10x4E3(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_E8 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsNavigationModifier : 1;                         // Mask: 0x1, PropSize: 0x10x4E4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlockNavigationLinks : 1;                         // Mask: 0x2, PropSize: 0x10x4E4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanExportNavigationCollisions : 1;                // Mask: 0x4, PropSize: 0x10x4E4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanExportNavigationObstacle : 1;                  // Mask: 0x8, PropSize: 0x10x4E4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorNavLinksX : 1;                              // Mask: 0x10, PropSize: 0x10x4E4(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrorNavLinksY : 1;                              // Mask: 0x20, PropSize: 0x10x4E4(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreMoveGoalCollisionRadius : 1;                // Mask: 0x40, PropSize: 0x10x4E4(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceDisableRootNavigationRelevance : 1;          // Mask: 0x80, PropSize: 0x10x4E4(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass : 1;                          // Mask: 0x1, PropSize: 0x10x4E5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass_NavmeshOnTop : 1;             // Mask: 0x2, PropSize: 0x10x4E5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceAutomationPass_SmashableFlat : 1;            // Mask: 0x4, PropSize: 0x10x4E5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsNavigationRelevant : 1;                         // Mask: 0x8, PropSize: 0x10x4E5(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBlockNavLinksInCell : 1;                          // Mask: 0x10, PropSize: 0x10x4E5(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseHotSpotAsMoveGoalReplacement : 1;              // Mask: 0x20, PropSize: 0x10x4E5(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_E9 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bWorldReadyCalled : 1;                             // Mask: 0x80, PropSize: 0x10x4E5(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBeingRotatedOrScaled : 1;                         // Mask: 0x1, PropSize: 0x10x4E6(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBeingTranslated : 1;                              // Mask: 0x2, PropSize: 0x10x4E6(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRotateInPlaceEditor : 1;                          // Mask: 0x4, PropSize: 0x10x4E6(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bEditorPlaced : 1;                                 // Mask: 0x8, PropSize: 0x10x4E6(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPlayerPlaced : 1;                                 // Mask: 0x10, PropSize: 0x10x4E6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bShouldTick : 1;                                   // Mask: 0x20, PropSize: 0x10x4E6(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUsesDayPhaseChange : 1;                           // Mask: 0x40, PropSize: 0x10x4E6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsDynamic : 1;                                    // Mask: 0x80, PropSize: 0x10x4E6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsDynamicOnDedicatedServer : 1;                   // Mask: 0x1, PropSize: 0x10x4E7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsMovable : 1;                                    // Mask: 0x2, PropSize: 0x10x4E7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisteredForDayPhaseChange : 1;                  // Mask: 0x4, PropSize: 0x10x4E7(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceDamagePing : 1;                              // Mask: 0x8, PropSize: 0x10x4E7(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyFoliageWhenPlaced : 1;                     // Mask: 0x10, PropSize: 0x10x4E7(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bObstructTrapTargeting : 1;                        // Mask: 0x20, PropSize: 0x10x4E7(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_EA : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bDoNotBlockBuildings : 1;                          // Mask: 0x80, PropSize: 0x10x4E7(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceBlockBuildings : 1;                          // Mask: 0x1, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreCollisionWithCriticalActors : 1;            // Mask: 0x2, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDestroyOnPlayerBuildingPlacement : 1;             // Mask: 0x4, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseCentroidForBlockBuildingsCheck : 1;            // Mask: 0x8, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsPlayerBuildable : 1;                            // Mask: 0x10, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFireBuiltAndDestroyedEvents : 1;                  // Mask: 0x20, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowInteract : 1;                                // Mask: 0x40, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowHostileBlueprintInteraction : 1;             // Mask: 0x80, PropSize: 0x10x4E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysUseNetCullDistanceSquaredForRelevancy : 1;  // Mask: 0x1, PropSize: 0x10x4E9(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHighlightDirty : 1;                               // Mask: 0x2, PropSize: 0x10x4E9(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForceReplayRollback : 1;                          // Mask: 0x4, PropSize: 0x10x4E9(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_EB : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EFortBuildingType                 BuildingType;                                      // 0x4EA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortTeam                         Team;                                              // 0x4EB(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F07[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnDied;                                            // 0x4F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDamaged;                                         // 0x508(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortMission*                          AssociatedMissionParam;                            // 0x518(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlacementActor*                   OriginatingPlacementActor;                         // 0x520(0x8)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnInteract;                                        // 0x528(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FCurveTableRowHandle                  InteractionSpeed;                                  // 0x538(0x10)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F08[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DataVersion;                                       // 0x578(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastTakeHitTimeTimeout;                            // 0x57C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                            PlayHitSound;                                      // 0x580(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CullDistance;                                      // 0x588(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SnapGridSize;                                      // 0x58C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        VertSnapGridSize;                                  // 0x590(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               SnapOffset;                                        // 0x594(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               CentroidOffset;                                    // 0x5A0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               BaseLocToPivotOffset;                              // 0x5AC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                CustomState;                                       // 0x5B8(0x10)(Net, ZeroConstructor, SaveGame, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingActorHotSpotConfig*           HotSpotConfig;                                     // 0x5C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnBuildingHealthChanged;                           // 0x5D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABuildingActor* GetDefaultObj();

	bool UseDefaultHealthBar();
	void SilentDie();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);
	void SetQuestHighlight(bool Enabled);
	void SetNavigationModifier(bool bEnableModifier);
	void SetHealthBarIndicatorDifficultyRating(int32 InDisplayLevel);
	void SetCustomState(const class FString& NewState);
	void SetCanExportNavigationObstacle(bool InCanExportNavigationObstacle);
	void RemoveEditorOnlyInstanceGameplayTags(struct FGameplayTagContainer& TagsToRemove);
	void PlacedByPlayer(class AFortPlayerStateZone* PlayerState);
	void PlacedByPlacementTool();
	void OnWorldReady();
	void OnSetCustomDepthStencilValue(TArray<class UPrimitiveComponent*>& PrimComponents, bool bUseCustomDepth, int32 StencilValue, bool* bOutConsume);
	void OnRep_Team();
	void OnRep_CustomState();
	void OnRep_CurrentBuildingLevel();
	void OnRep_BuildingAttributeSet();
	void OnRep_bForceReplayRollback();
	void OnRep_AbilitySystemComponent();
	void OnMatchStarted();
	void OnDeathServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDayPhaseChanged(enum class EFortDayPhase CurrentDayPhase, enum class EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void OnDamageServer(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDamagePlayEffects(float Damage, struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnBuildingActorInitialized(enum class EFortBuildingInitializationReason InitializationReason, enum class EFortBuildingPersistentState BuildingPersistentState);
	bool IsPlayerBuilt();
	bool IsDamaged();
	bool IsAcceptablePositionForPlacement(struct FVector& InLocation, struct FRotator& InRotation, class AFortDecoTool* DecoTool, bool bIsCDO, class FText* OutFailureReason);
	void InitializeKismetSpawnedBuildingActor(class ABuildingActor* BuildingOwner, class AFortPlayerController* SpawningController);
	bool HasHealthLeft();
	void HandleDestroyed();
	float GetShieldPercent();
	float GetShieldOrHealthPercent();
	float GetShield();
	class AFortPlayerState* GetOwningPlayerState();
	class AController* GetOwningController();
	float GetMissingHealth();
	float GetMaxShield();
	float GetMaxHealth();
	float GetHealthPercent();
	float GetHealth();
	void GetEditorTestTags(struct FGameplayTagContainer* TagContainer);
	class FString GetCustomState();
	int32 GetCurrentBuildingLevel();
	struct FVector GetCentroid();
	void GameplayCue_InstantDeath(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Healing(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Damage(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ForceBuildingHealth(float NewHealth);
	void CustomStateChanged();
	bool BlueprintOnLocalInteract(class AFortPlayerPawn* InteractingPawn);
	void BlueprintOnInteract(class AFortPawn* InteractingPawn);
	void BlueprintOnBeginInteract();
	class FText BlueprintGetInteractionString(class AFortPawn* InteractingPawn);
	class FText BlueprintGetFailedInteractionString(class AFortPawn* InteractingPawn);
	bool BlueprintCanInteract(class AFortPawn* InteractingPawn);
	void AddEditorOnlyInstanceGameplayTags(struct FGameplayTagContainer& NewTags);
};

// 0x80 (0x660 - 0x5E0)
// Class FortniteGame.BGAConsumableSpawner
class ABGAConsumableSpawner : public ABuildingActor
{
public:
	uint8                                        Pad_F11[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       DummyRoot;                                         // 0x5F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  SpawnLootTierGroup;                                // 0x5F8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingActor*                        AssociatedBuildingActor;                           // 0x600(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEnvQuery*                             QueryTemplate;                                     // 0x608(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAIDynamicParam>               QueryConfig;                                       // 0x610(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bAlignSpawnedActorsToSurface;                      // 0x620(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F13[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFortItemEntry>                ConsumablesToSpawn;                                // 0x628(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F14[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABGAConsumableSpawner* GetDefaultObj();

};

// 0x30 (0x2F0 - 0x2C0)
// Class FortniteGame.BGAConsumableWrapperItemDefinition
class UBGAConsumableWrapperItemDefinition : public UFortItemDefinition
{
public:
	TSoftClassPtr<class ABuildingGameplayActorConsumable> ConsumableClass;                                   // 0x2C0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F17[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBGAConsumableWrapperItemDefinition* GetDefaultObj();

};

// 0x50 (0x640 - 0x5F0)
// Class FortniteGame.BuildingActorEditorComponent
class UBuildingActorEditorComponent : public UStaticMeshComponent
{
public:
	TSoftObjectPtr<class UMaterialInterface>     CurrentlySnappedMaterial;                          // 0x5F0(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            CubeMesh;                                          // 0x618(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuildingActorEditorComponent* GetDefaultObj();

};

// 0xF0 (0x120 - 0x30)
// Class FortniteGame.BuildingActorHotSpotConfig
class UBuildingActorHotSpotConfig : public UDataAsset
{
public:
	struct FBuildingActorHotSpotDirection        DirectionSetup[0x6];                               // 0x30(0xC0)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBuildingActorHotSpotDirection        DefaultSetup;                                      // 0xF0(0x20)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UAIHotSpotConfig*                      ExtraTypeConfig;                                   // 0x110(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasDirectionalSetup : 1;                          // Mask: 0x1, PropSize: 0x10x118(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F1A[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingActorHotSpotConfig* GetDefaultObj();

};

// 0x0 (0x560 - 0x560)
// Class FortniteGame.BuildingActorHotSpotRenderingComponent
class UBuildingActorHotSpotRenderingComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UBuildingActorHotSpotRenderingComponent* GetDefaultObj();

};

// 0x580 (0xB60 - 0x5E0)
// Class FortniteGame.BuildingSMActor
class ABuildingSMActor : public ABuildingActor
{
public:
	uint8                                        Pad_F34[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UBuildingTextureData*                  TextureData[0x4];                                  // 0x5E8(0x20)(Edit, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           StaticMesh;                                        // 0x608(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTierMeshSets>                 AlternateMeshes;                                   // 0x610(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        AltMeshIdx;                                        // 0x620(0x4)(Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortResourceType                 ResourceType;                                      // 0x624(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowBuildingCheat : 1;                           // Mask: 0x1, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMirrored : 1;                                     // Mask: 0x2, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoCollision : 1;                                  // Mask: 0x4, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoCameraCollision : 1;                            // Mask: 0x8, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCameraOnlyCollision : 1;                          // Mask: 0x10, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoPawnCollision : 1;                              // Mask: 0x20, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoAIPawnCollision : 1;                            // Mask: 0x40, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoWeaponCollision : 1;                            // Mask: 0x80, PropSize: 0x10x625(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoRangedWeaponCollision : 1;                      // Mask: 0x1, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoProjectileCollision : 1;                        // Mask: 0x2, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDoNotBlockInteract : 1;                           // Mask: 0x4, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlocksCeilingPlacement : 1;                       // Mask: 0x8, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlocksAttachmentPlacement : 1;                    // Mask: 0x10, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSupportsRepairing : 1;                            // Mask: 0x20, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRandomYawOnPlacement : 1;                         // Mask: 0x40, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRandomScaleOnPlacement : 1;                       // Mask: 0x80, PropSize: 0x10x626(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bClearMIDWhenReturningToUndamagedState : 1;        // Mask: 0x1, PropSize: 0x10x627(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_EC : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAllowResourceDrop : 1;                            // Mask: 0x8, PropSize: 0x10x627(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHideOnDeath : 1;                                  // Mask: 0x10, PropSize: 0x10x627(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPlayDestructionEffects : 1;                       // Mask: 0x20, PropSize: 0x10x627(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bSupportedDirectly : 1;                            // Mask: 0x40, PropSize: 0x10x627(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bForciblyStructurallySupported : 1;                // Mask: 0x80, PropSize: 0x10x627(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisterWithStructuralGrid : 1;                   // Mask: 0x1, PropSize: 0x10x628(0x1)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnderConstruction : 1;                            // Mask: 0x2, PropSize: 0x10x628(0x1)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnderRepair : 1;                                  // Mask: 0x4, PropSize: 0x10x628(0x1)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCollisionBlockedByPawns : 1;                      // Mask: 0x8, PropSize: 0x10x628(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_ED : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCurrentlyBeingEdited : 1;                         // Mask: 0x20, PropSize: 0x10x628(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_EE : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAllowWeakSpots : 1;                               // Mask: 0x80, PropSize: 0x10x628(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseComplexForWeakSpots : 1;                       // Mask: 0x1, PropSize: 0x10x629(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanSpawnAtLowerQuotaLevels : 1;                   // Mask: 0x2, PropSize: 0x10x629(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeedsWindMaterialParameters : 1;                  // Mask: 0x4, PropSize: 0x10x629(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPropagatesBounceEffects : 1;                      // Mask: 0x8, PropSize: 0x10x629(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNeedsDamageOverlay : 1;                           // Mask: 0x10, PropSize: 0x10x629(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIsInitiallyBuilding : 1;                          // Mask: 0x20, PropSize: 0x10x629(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_EF : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class ELootQuotaLevel                   MaximumQuotaLevelBound;                            // 0x62A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F35[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             RandomScaleRange;                                  // 0x62C(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortBounceData                       BounceData;                                        // 0x634(0x30)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	float                                        InfluenceMapWeight;                                // 0x664(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  BASEEffectMeshComponent;                           // 0x668(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuildingNavObstacle>          NavObstacles;                                      // 0x670(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                  CachedNavAreaHusk;                                 // 0x680(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavArea>                  CachedNavAreaSmasher;                              // 0x688(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F36[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BuildingPlacementDistance;                         // 0x6A8(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize100                ReplicatedDrawScale3D;                             // 0x6B4(0xC)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*             ReplicatedMIC;                                     // 0x6C0(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FEditorOnlyBuildingInstanceMaterialParameters EditorOnlyInstanceMaterialParameters;              // 0x6C8(0x30)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  StaticMeshComponent;                               // 0x6F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                    BaseMaterial;                                      // 0x700(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  DestructionLootTierGroup;                          // 0x708(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FChosenQuotaInfo                      DestructionLootTierChosenQuotaInfo;                // 0x710(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                  DestructionLootTierKey;                            // 0x720(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  BuildingResourceAmountOverride;                    // 0x728(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxResourcesToSpawn;                               // 0x738(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F37[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UCurveLinearColor>      WindSpeedCurve;                                    // 0x740(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UCurveLinearColor>      WindPannerSpeedCurve;                              // 0x768(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UMaterialInterface>> IntenseWindMaterials;                              // 0x790(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             WindAudio;                                         // 0x7A0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       BreakEffect;                                       // 0x7C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       DeathParticles;                                    // 0x7D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  DeathParticleSocketName;                           // 0x7D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                            DeathSound;                                        // 0x7E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       ConstructedEffect;                                 // 0x7E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ShieldBuffMaterialParamValue1;                     // 0x7F0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ShieldBuffMaterialParamValue2;                     // 0x7F4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AnimatingDistanceFieldSelfShadowBias;              // 0x7F8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F38[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRandomDayphaseFX>             RandomDayphaseFXList;                              // 0x800(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UAudioComponent*                       ConstructionAudioComponent;                        // 0x810(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      AnimatingMIDs;                                     // 0x818(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  DamageOverlayComponent;                            // 0x828(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              MIDDamageOverlay;                                  // 0x830(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageAmountStart;                                 // 0x838(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastDamageAmount;                                  // 0x83C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FHitResult                            LastDamageHit;                                     // 0x840(0x88)(Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F39[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnRepairBuildingStarted;                           // 0x928(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnRepairBuildingFinished;                          // 0x938(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FFortConnectivityComponentData        ConnectivityData;                                  // 0x948(0x18)(SaveGame, NativeAccessSpecifierPublic)
	class UBuildingEditModeMetadata*             EditModePatternData;                               // 0x960(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UndermineGroup;                                    // 0x968(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        LogicalBuildingIdx;                                // 0x96C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    AnimatingMaterial;                                 // 0x970(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    DamagedButNotAnimatingMaterial;                    // 0x978(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    AnimatingMaterialMobile;                           // 0x980(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    DamagedButNotAnimatingMaterialMobile;              // 0x988(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class UMaterialInterface*, class UMaterialInterface*> AnimatingMaterials;                                // 0x990(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class UMaterialInterface*, class UMaterialInterface*> DamagedButNotAnimatingMaterials;                   // 0x9E0(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        AnimatingSubObjects;                               // 0xA30(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumFrameSubObjects;                                // 0xA34(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UBuildingEditModeSupport>  EditModeSupportClass;                              // 0xA38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeSupport*              EditModeSupport;                                   // 0xA40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HealthToAutoBuild;                                 // 0xA48(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AccumulatedAutoBuildTime;                          // 0xA4C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingReplacementType          BuildingReplacementType;                           // 0xA50(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingReplacementType          ReplacementDestructionReason;                      // 0xA51(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAnim                     CurBuildingAnimType;                               // 0xA52(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortDamageVisualsState           DamageVisualsState;                                // 0xA53(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurAnimSubObjectNum;                               // 0xA54(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurBuildingAnimStartTime;                          // 0xA58(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurAnimSubObjectTargetNum;                         // 0xA5C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>      BlueprintMIDs;                                     // 0xA60(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  BlueprintMeshComp;                                 // 0xA70(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerStateZone*                  EditingPlayer;                                     // 0xA78(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                            ConnectivityIcon;                                  // 0xA80(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F3B[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BuildingAttachmentPointOffset;                     // 0xAA0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BuildingAttachmentRadius;                          // 0xAAC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAttachmentSlot           BuildingAttachmentSlot;                            // 0xAB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildingAttachmentType           BuildingAttachmentType;                            // 0xAB1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EPlacementType                    BuildingPlacementType;                             // 0xAB2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EStructuralSupportCheck           LastStructuralCheck;                               // 0xAB3(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PlayerGridSnapSize;                                // 0xAB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingSMActor*                      ParentActorToAttachTo;                             // 0xAB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABuildingSMActor*>              AttachedBuildingActors;                            // 0xAC0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class ABuildingSMActor*>              BuildingActorsAttachedTo;                          // 0xAD0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	UMulticastDelegateProperty_                  OnTrapPlacementChanged;                            // 0xAE0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnReplacementDestruction;                          // 0xAF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class ABuildingSMActor*>              AttachmentPlacementBlockingActors;                 // 0xB00(0x10)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UBuildingConnectivityComponent*        ConnectivityComponent;                             // 0xB10(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ABuildingFoundation>    Foundation;                                        // 0xB18(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                       LODActorIndexInFoundation;                         // 0xB20(0x2)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                       ActorIndexInFoundation;                            // 0xB22(0x2)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_F3D[0x14];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABuildingSMActor*                      DamagerOwner;                                      // 0xB38(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortConstructorBASE*                  RelevantBASE;                                      // 0xB40(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortConstructorBASE*                  LastRelevantBASE;                                  // 0xB48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_F3F[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingSMActor* GetDefaultObj();

	bool WillRegisterWithStructuralGrid();
	void UpdateRepairMaterialAnim(float CurveValue);
	void UpdateLODOverrideEffect(float CurveValue);
	void UpdateDynamicShrinkAndDestroyEffect(float CurveValue);
	void SetTextureData(TArray<class UTexture2D*>& InTextures);
	void SetMirrored(bool bIsMirrored);
	void RepairBuilding(class AFortPlayerController* RepairingController, int32 ResourcesSpent);
	TArray<class UTexture2D*> ReadTextureData();
	void OnRepairStarted();
	void OnRep_ResourceType(enum class EFortResourceType OldType);
	void OnRep_ReplicatedMIC();
	void OnRep_ReplicatedDrawScale3D();
	void OnRep_RelevantBASE();
	void OnRep_MetaData();
	void OnRep_EditingPlayer();
	void OnRep_bUnderRepair();
	void OnRep_bUnderConstruction();
	void OnRep_BuildingReplacementType();
	void OnRep_bCollisionBlockedByPawns();
	void OnLODOverrideEffectFinished();
	void OnDynamicShrinkAndDestroyEffectFinished();
	void OnDetachFromBuilding(class ABuildingSMActor* AttachedToBuilding, bool bBeingDestroyed);
	void OnBounceAnimationUpdate(const struct FFortBounceData& Data);
	void OnAttachToBuilding(class ABuildingSMActor* AttachedToBuilding);
	void MulticastRequestBuildingAnimation(enum class EBuildingAnim RequestedAnimation);
	void MulticastPlayFullHealthEffects();
	void MarkConnectedBuildingsForStructuralIntegrityCheck();
	bool IsSupportedByWorld();
	bool IsStructurallySupported();
	bool HasDestructionLoot();
	class UCurveLinearColor* GetWindSpeedCurveForPreview();
	class UCurveLinearColor* GetWindPannerSpeedCurveForPreview();
	enum class EBuildingReplacementType GetReplacementDestructionReason();
	int32 GetLogicalBuildingIndex();
	bool GetIntenseWindMaterialsForPreview(TArray<class UMaterialInterface*>* Materials);
	class UStaticMeshComponent* GetBuildingMeshComponent();
	TArray<class ABuildingSMActor*> GetAttachedBuildingActors();
	class UMaterialInstanceDynamic* GetAnimatingMID(int32 ElementIndex);
	void GameplayCue_Abilities_Activation_Generic_BannerWallBuff2(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void GameplayCue_Abilities_Activation_Generic_BannerWallBuff1(enum class EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ForceIntoStructuralGridDuringRuntime();
	void EditorOnlySetInstanceMaterialVectorParameter(class FName ParamName, const struct FLinearColor& Value);
	void EditorOnlySetInstanceMaterialTextureParameter(class FName ParamName, class UTexture* Value);
	void EditorOnlySetInstanceMaterialScalarParameter(class FName ParamName, float Value);
	void EditorOnlyRemoveInstanceMaterialVectorParameter(class FName ParamName);
	void EditorOnlyRemoveInstanceMaterialTextureParameter(class FName ParamName);
	void EditorOnlyRemoveInstanceMaterialScalarParameter(class FName ParamName);
	void DetachBuildingActorFromMe(class ABuildingSMActor* ActorToAttach, bool bBeingDestroyed);
	void BlueprintOnStructurallyUnstable();
	void BlueprintOnStructurallyStable();
	void AttachBuildingActorToMe(class ABuildingSMActor* ActorToAttach, bool bForceAttachment);
};

// 0x8 (0xB68 - 0xB60)
// Class FortniteGame.BuildingAutoNav
class ABuildingAutoNav : public ABuildingSMActor
{
public:
	uint8                                        bAutoAssignNavProperties : 1;                      // Mask: 0x1, PropSize: 0x10xB60(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F43[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingAutoNav* GetDefaultObj();

};

// 0xC8 (0x6A8 - 0x5E0)
// Class FortniteGame.BuildingGameplayActor
class ABuildingGameplayActor : public ABuildingActor
{
public:
	uint8                                        Pad_F4B[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAbilitySet*                       AbilitySet;                                        // 0x5F0(0x8)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAbilitySet*                       InherentAbilitySets[0x5];                          // 0x5F8(0x28)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortDamageSet*                        DamageSet;                                         // 0x620(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   DamageStatHandle;                                  // 0x628(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bIgnoreInstigatorCollision;                        // 0x638(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAddOwnerVelocity;                                 // 0x639(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F4C[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AbilitySourceLevel;                                // 0x63C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBuildingGameplayActorAbilityDeliveryInfo DeliverableAbilityInfo;                            // 0x640(0x48)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        bApplyDefaultEnabledAbilityBucketsOnInit : 1;      // Mask: 0x1, PropSize: 0x10x688(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseSimpleActorTouchSetupForAbilityBuckets : 1;    // Mask: 0x2, PropSize: 0x10x688(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F0 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F4D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   RegisteredTouchComponent;                          // 0x690(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F4E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UProjectileMovementComponent*          ProjectileMovementComponent;                       // 0x6A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ABuildingGameplayActor* GetDefaultObj();

	void SetTouchComponentForAbilityDeliveryInfo(class UPrimitiveComponent* PrimitiveComponent);
	void SetInitialVelocity(struct FVector& InitialVelocity);
	void SetIgnoreInstigatorCollision(bool bShouldIgnore);
	void SetAbilitySourceLevel(int32 NewAbilitySourceLevel);
	void OnReplicatedVelocityStartOrStop(bool bStart);
	void OnRegisteredTouchComponentEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnRegisteredTouchComponentBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnDropped(bool bValidLocation, bool bPassesPlacementRestrictions, bool bWasIntentionallyPlaced);
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag);
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context);
	struct FTransform GetTargetingSourceTransform(enum class EFortAbilityTargetingSource Source);
	void ForceChangeOwnerInstigator(class AFortPlayerController* NewInstigator);
	void EnableAbilityDeliveryInfo(const struct FGameplayTag& BucketTag);
	void DisableAbilityDeliveryInfo(const struct FGameplayTag& BucketTag);
};

// 0xA0 (0x748 - 0x6A8)
// Class FortniteGame.BuildingCapturePointActor
class ABuildingCapturePointActor : public ABuildingGameplayActor
{
public:
	uint8                                        bUseHUDIndicator : 1;                              // Mask: 0x1, PropSize: 0x10x6A8(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F1 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F59[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  HUDStyle;                                          // 0x6B0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               HUDOffset;                                         // 0x6B8(0xC)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHUDClampToScreenEdge : 1;                         // Mask: 0x1, PropSize: 0x10x6C4(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F2 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F5B[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USphereComponent*                      CollisionComponent;                                // 0x6D0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bActivated : 1;                                    // Mask: 0x1, PropSize: 0x10x6D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F3 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F5C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EContentionRules                  ContentionRules;                                   // 0x6DC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F5D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EFortTeam>                 TeamsBarredFromCapture;                            // 0x6E0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        PercentIncreasePerPlayerCaptor;                    // 0x6F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PercentIncreasePerAICaptor;                        // 0x6F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PercentDecreaseNoCaptor;                           // 0x6F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLocked : 1;                                       // Mask: 0x1, PropSize: 0x10x6FC(0x1)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F4 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F5E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UnlockInterval;                                    // 0x700(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EUnlockRules                      UnlockRules;                                       // 0x704(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F5F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumCapturingPoint;                                 // 0x708(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamCapturingPoint;                                // 0x70C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamControllingPoint;                              // 0x70D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortTeam                         TeamOwningPoint;                                   // 0x70E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECaptureState                     CaptureState;                                      // 0x70F(0x1)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CapturePercentage;                                 // 0x710(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ReplicatedCapturePercentage;                       // 0x714(0x4)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnCapturePointStateChanged;                        // 0x718(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnTeamOwningPointChanges;                          // 0x728(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F60[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingCapturePointActor* GetDefaultObj();

	void SetActivatedState(bool bInActivated);
	void OnRep_ReplicatedCapturePercentage();
	void OnRep_CaptureState();
	void OnRep_bLocked();
	void OnRep_bActivated();
	void OnLeaveCapturePoint(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnEnterCapturePoint(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnCapturePointStateChange(enum class ECaptureState InState, enum class EFortTeam InTeam);
	void OnCapturePointLockStateChange(bool bInLocked);
	void OnCapturePointActiveStateChange(bool bInActive);
	enum class ECaptureState GetCaptureState();
};

// 0xD8 (0x310 - 0x238)
// Class FortniteGame.BuildingConnectivityComponent
class UBuildingConnectivityComponent : public USceneComponent
{
public:
	TArray<struct FFortConnectionData>           Connections;                                       // 0x238(0x10)(Net, ZeroConstructor, SaveGame, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          SocketNames;                                       // 0x248(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bAutoConnectOnInitialize;                          // 0x258(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDrawDebugData;                                    // 0x259(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F64[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABuildingSMActor*                      BuildingOwner;                                     // 0x260(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ABuildingConnectivityEffect*>   ConnectionEffects;                                 // 0x268(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsPowered;                                        // 0x278(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsProvidingPower;                                 // 0x279(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsAbleToProvidePower;                             // 0x27A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowConnections;                                 // 0x27B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowsPowerToPassThrough;                         // 0x27C(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F65[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  AuthorityOnConnectedDelegate;                      // 0x280(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  AuthorityOnDisconnectedDelegate;                   // 0x290(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  ClientOnConnectedDelegate;                         // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  ClientOnDisconnectedDelegate;                      // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  AuthorityOnPoweredDelegate;                        // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  AuthorityOnUnpoweredDelegate;                      // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  ClientOnPoweredDelegate;                           // 0x2E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  ClientOnUnpoweredDelegate;                         // 0x2F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F66[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingConnectivityComponent* GetDefaultObj();

	void OnRep_Connections();
	void OnRep_bIsProvidingPower();
	void OnRep_bIsPowered();
	void OnPlaced();
	bool K2_IsPowered();
	bool IsConnectedTo(class ABuildingSMActor* TestActor);
	void DrawDebugData();
	void DisconnectAll();
	bool CanConnectTo(class ABuildingSMActor* TestActor);
};

// 0x38 (0x360 - 0x328)
// Class FortniteGame.BuildingConnectivityEffect
class ABuildingConnectivityEffect : public AActor
{
public:
	struct FFortConnectionData                   ConnectionData;                                    // 0x328(0x30)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bDebugDraw;                                        // 0x358(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F69[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingConnectivityEffect* GetDefaultObj();

	void OnDisconnect();
	void OnConnect(struct FTransform& T1, struct FTransform& T2);
};

// 0x10 (0x338 - 0x328)
// Class FortniteGame.BuildingConnectivityManager
class ABuildingConnectivityManager : public AActor
{
public:
	TArray<class ABuildingSMActor*>              ConnectivityActors;                                // 0x328(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingConnectivityManager* GetDefaultObj();

};

// 0x48 (0xBB0 - 0xB68)
// Class FortniteGame.BuildingTimeOfDayLights
class ABuildingTimeOfDayLights : public ABuildingAutoNav
{
public:
	TArray<class ULightComponent*>               TimeOfDayControlledLights;                         // 0xB68(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                       TimeOfDayControlledLightsPositions;                // 0xB78(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                TimeOfDayControlledLightsInitalIntensities;        // 0xB88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_F6B[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingTimeOfDayLights* GetDefaultObj();

	void GetTimeOfDayBlueprintDefaultVariables(struct FTimeOfDayBlueprintDefaultVariables* OutVariables);
};

// 0x110 (0xCC0 - 0xBB0)
// Class FortniteGame.BuildingContainer
class ABuildingContainer : public ABuildingTimeOfDayLights
{
public:
	class USoundCue*                             SearchingSoundCueLoop;                             // 0xBB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             LootRepeatSoundCue;                                // 0xBB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             OnDamageSoundCue;                                  // 0xBC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             OnDeathSoundCue;                                   // 0xBC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           SearchedMesh;                                      // 0xBD0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>            SearchedMaterialOverrides;                         // 0xBD8(0x10)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	class FName                                  SearchLootTierGroup;                               // 0xBE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FChosenQuotaInfo                      SearchLootTierChosenQuotaInfo;                     // 0xBF0(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                  ContainerLootTierKey;                              // 0xC00(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ReplicatedLootTier;                                // 0xC08(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             NumItemsToDropRange;                               // 0xC0C(0x8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SearchBounceRadiusOverride;                        // 0xC14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*              LootTestingData;                                   // 0xC18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LootNoiseRange;                                    // 0xC20(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LootSpawnLocation;                                 // 0xC24(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LootFinalLocation;                                 // 0xC30(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               InstancedLoot_TossDirection;                       // 0xC3C(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InstancedLoot_TossSpeed;                           // 0xC48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InstancedLoot_TossConeHalfAngle;                   // 0xC4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LootSpawnLocation_Athena;                          // 0xC50(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LootTossDirection_Athena;                          // 0xC5C(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LootTossSpeed_Athena;                              // 0xC68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LootTossConeHalfAngle_Athena;                      // 0xC6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortRarity                       HighestRarity;                                     // 0xC70(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysShowContainer : 1;                          // Mask: 0x1, PropSize: 0x10xC71(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysMaintainLoot : 1;                           // Mask: 0x2, PropSize: 0x10xC71(0x1)(Edit, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDestroyContainerOnSearch : 1;                     // Mask: 0x4, PropSize: 0x10xC71(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlreadySearched : 1;                              // Mask: 0x8, PropSize: 0x10xC71(0x1)(BlueprintVisible, Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F5 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F76[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bBuriedTreasure : 1;                               // Mask: 0x1, PropSize: 0x10xC73(0x1)(Edit, BlueprintVisible, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHasRaisedTreasure : 1;                            // Mask: 0x2, PropSize: 0x10xC73(0x1)(Edit, BlueprintVisible, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bStartAlreadySearched_Athena : 1;                  // Mask: 0x4, PropSize: 0x10xC73(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegenerateLoot : 1;                               // Mask: 0x8, PropSize: 0x10xC73(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseLocationForDrop : 1;                           // Mask: 0x10, PropSize: 0x10xC73(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F6 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	float                                        LootedWeaponsDurabilityModifier;                   // 0xC74(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSearchBounceData                 SearchBounceData;                                  // 0xC78(0x10)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCurveTableRowHandle                  SearchSpeed;                                       // 0xC88(0x10)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F77[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CurrentInteractBounceCurve;                        // 0xCA8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           CurrentInteractBounceNormalCurve;                  // 0xCB0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SavedReservedRandomValueResult;                    // 0xCB8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeUntilLootRegenerates;                          // 0xCBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingContainer* GetDefaultObj();

	void RaiseTreasure();
	void OnSetSearched();
	void OnSearchInterrupted();
	void OnRep_bAlreadySearched();
	void OnRaiseTreasure();
	void OnLootReset();
	void OnLootRepeat();
	void OnLoot();
	void OnBeginSearch();
	int32 GetLootTier();
	void EnableBacchusHighlight();
	void DisableBacchusHighlight();
	void BounceContainer();
};

// 0x10 (0xB78 - 0xB68)
// Class FortniteGame.BuildingCorner
class ABuildingCorner : public ABuildingAutoNav
{
public:
	class ABuildingSMActor*                      PrimaryWall;                                       // 0xB68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingSMActor*                      SecondaryWall;                                     // 0xB70(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingCorner* GetDefaultObj();

};

// 0x8 (0xB70 - 0xB68)
// Class FortniteGame.BuildingDeco
class ABuildingDeco : public ABuildingAutoNav
{
public:
	bool                                         bCastShadow;                                       // 0xB68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F7C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingDeco* GetDefaultObj();

};

// 0xF0 (0x120 - 0x30)
// Class FortniteGame.BuildingEditModeMetadata
class UBuildingEditModeMetadata : public UDataAsset
{
public:
	uint8                                        bSupportNextPieceAssist : 1;                       // Mask: 0x1, PropSize: 0x10x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasNavigableOpening : 1;                          // Mask: 0x2, PropSize: 0x10x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasCustomAttackLocation : 1;                      // Mask: 0x4, PropSize: 0x10x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F7 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F80[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UBuildingActorHotSpotConfig*           DefaultHotspotConfig;                              // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIHotSpotConfig*                      ShootingHotSpotConfig;                             // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 ShapeGuid;                                         // 0x48(0x10)(Edit, EditConst, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F81[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FConnectivityCube                     ConnectivityCubeData;                              // 0x60(0xC0)(Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata* GetDefaultObj();

};

// 0x10 (0x130 - 0x120)
// Class FortniteGame.BuildingEditModeMetadata_BinaryToggle
class UBuildingEditModeMetadata_BinaryToggle : public UBuildingEditModeMetadata
{
public:
	TArray<enum class EBinaryToggleValues>       TileData;                                          // 0x120(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata_BinaryToggle* GetDefaultObj();

};

// 0x0 (0x130 - 0x130)
// Class FortniteGame.BuildingEditModeMetadata_Floor
class UBuildingEditModeMetadata_Floor : public UBuildingEditModeMetadata_BinaryToggle
{
public:

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata_Floor* GetDefaultObj();

};

// 0x0 (0x120 - 0x120)
// Class FortniteGame.BuildingEditModeMetadata_Pillar
class UBuildingEditModeMetadata_Pillar : public UBuildingEditModeMetadata
{
public:

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata_Pillar* GetDefaultObj();

};

// 0x10 (0x140 - 0x130)
// Class FortniteGame.BuildingEditModeMetadata_Roof
class UBuildingEditModeMetadata_Roof : public UBuildingEditModeMetadata_BinaryToggle
{
public:
	TArray<struct FAuxiliaryEditTileMeshData>    AuxEditTileMeshData;                               // 0x130(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata_Roof* GetDefaultObj();

};

// 0x10 (0x130 - 0x120)
// Class FortniteGame.BuildingEditModeMetadata_Stair
class UBuildingEditModeMetadata_Stair : public UBuildingEditModeMetadata
{
public:
	TArray<int32>                                TileData;                                          // 0x120(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata_Stair* GetDefaultObj();

};

// 0x0 (0x130 - 0x130)
// Class FortniteGame.BuildingEditModeMetadata_Wall
class UBuildingEditModeMetadata_Wall : public UBuildingEditModeMetadata_BinaryToggle
{
public:

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadata_Wall* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class FortniteGame.BuildingEditModeMetadataContainer
class UBuildingEditModeMetadataContainer : public UDataAsset
{
public:
	TArray<class UBuildingEditModeMetadata*>     MetadataCollection;                                // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuildingEditModeMetadataContainer* GetDefaultObj();

};

// 0x248 (0x270 - 0x28)
// Class FortniteGame.BuildingEditModeSupport
class UBuildingEditModeSupport : public UObject
{
public:
	class ABuildingSMActor*                      OwnerBuilding;                                     // 0x28(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerController*                 EditingController;                                 // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeMetadata*             PreviewMetadata;                                   // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeMetadata*             ScratchpadMetadata;                                // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UBuildingEditModeMetadata> ExpectedMetadataClass;                             // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class ABuildingSMActor>>  PossibleEditClasses;                               // 0x50(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>            EditTileMesh;                                      // 0x60(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>          EditTileMeshComponents;                            // 0x88(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>     TileMaterialParent;                                // 0x98(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             ActiveTileTexture;                                 // 0xC0(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             InactiveTileTexture;                               // 0xE8(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  LastInteractedComp;                                // 0x110(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  LastHighlightedComp;                               // 0x118(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  PreviewComponent;                                  // 0x120(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>     PreviewMaterial;                                   // 0x128(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FEditModeState                        PreviewEditModeState;                              // 0x150(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UCurveFloat>            SuccessfulPatternMatchCurve;                       // 0x160(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimeline                             SuccessfulMatchInteractTimeline;                   // 0x188(0x98)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        bCanMirrorMetadataToMatch : 1;                     // Mask: 0x1, PropSize: 0x10x220(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanRotateMetadataToMatch : 1;                     // Mask: 0x2, PropSize: 0x10x220(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bEditActionInProgress : 1;                         // Mask: 0x4, PropSize: 0x10x220(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInitializedTimelines : 1;                         // Mask: 0x8, PropSize: 0x10x220(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F93[0x4F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport* GetDefaultObj();

	void OnSuccessfulMatchInteractParamUpdate(float NewInteractParamVal);
	void OnSuccessfulMatchInteractComplete();
};

// 0x20 (0x290 - 0x270)
// Class FortniteGame.BuildingEditModeSupport_BinaryToggle
class UBuildingEditModeSupport_BinaryToggle : public UBuildingEditModeSupport
{
public:
	class UBuildingEditModeMetadata_BinaryToggle* BinaryTogglePreviewData;                           // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBinaryToggleValues               CurToggleAction;                                   // 0x278(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F99[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          DefaultBlueTileColor;                              // 0x27C(0x10)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_F9A[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport_BinaryToggle* GetDefaultObj();

};

// 0x0 (0x290 - 0x290)
// Class FortniteGame.BuildingEditModeSupport_Floor
class UBuildingEditModeSupport_Floor : public UBuildingEditModeSupport_BinaryToggle
{
public:

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport_Floor* GetDefaultObj();

};

// 0x20 (0x2B0 - 0x290)
// Class FortniteGame.BuildingEditModeSupport_Roof
class UBuildingEditModeSupport_Roof : public UBuildingEditModeSupport_BinaryToggle
{
public:
	TArray<struct FTileCompInterpData>           TileInterpData;                                    // 0x290(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_FA4[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport_Roof* GetDefaultObj();

};

// 0xD0 (0x340 - 0x270)
// Class FortniteGame.BuildingEditModeSupport_Stair
class UBuildingEditModeSupport_Stair : public UBuildingEditModeSupport
{
public:
	class UBuildingEditModeMetadata_Stair*       StairPreviewMetadata;                              // 0x270(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBuildingEditModeMetadata_Stair*       LastValidMetadataConfiguration;                    // 0x278(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStaticMesh>            AuxiliaryIndicatorMesh;                            // 0x280(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>          AuxiliaryIndicatorComponents;                      // 0x2A8(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                  ActivatedAuxIndicatorComponent;                    // 0x2B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterialInterface>     AuxIndicatorComponentParentMaterial;               // 0x2C0(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             AuxIndicatorArrowTexture;                          // 0x2E8(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             AuxIndicatorGridTexture;                           // 0x310(0x28)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FB3[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport_Stair* GetDefaultObj();

};

// 0x0 (0x290 - 0x290)
// Class FortniteGame.BuildingEditModeSupport_Wall
class UBuildingEditModeSupport_Wall : public UBuildingEditModeSupport_BinaryToggle
{
public:

	static class UClass* StaticClass();
	static class UBuildingEditModeSupport_Wall* GetDefaultObj();

};

// 0x58 (0x700 - 0x6A8)
// Class FortniteGame.BuildingFlagSpawn
class ABuildingFlagSpawn : public ABuildingGameplayActor
{
public:
	uint8                                        Pad_FC1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               HUDIndicatorRelativeOffset;                        // 0x6B0(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPickupOnTouch;                                    // 0x6BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FC3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AFortCarriedObject>        CarriedObjectClass;                                // 0x6C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeTranslation;                               // 0x6C8(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FC5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortCarriedObject*                    SpawnedObject;                                     // 0x6D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpawnDelay;                                        // 0x6E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FC8[0x1C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingFlagSpawn* GetDefaultObj();

	void SpawnCarriedObject();
	void OnCarriedObjectDetachedEvent();
	void OnCarriedObjectAttachedEvent();
	bool IsSpawnedObjectAwayFromBase();
};

// 0x8 (0xB68 - 0xB60)
// Class FortniteGame.BuildingFloor
class ABuildingFloor : public ABuildingSMActor
{
public:
	uint8                                        bShouldIgnoreForHorizontalHotspotSearch : 1;       // Mask: 0x1, PropSize: 0x10xB60(0x1)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_FCF[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingFloor* GetDefaultObj();

	bool IsBalcony();
};

// 0x280 (0x928 - 0x6A8)
// Class FortniteGame.BuildingFOBConfigActor
class ABuildingFOBConfigActor : public ABuildingGameplayActor
{
public:
	UMulticastDelegateProperty_                  OnIOOperationComplete;                             // 0x6A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                ExplicitSaveFile;                                  // 0x6B8(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortBuildingInstructions> FallbackBuildingInstructions;                      // 0x6C8(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                CoreSaveFileUniqueContext;                         // 0x6F0(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class ABuildingFOBCoreSpawnPad> CreationModeSpawnPadClass;                         // 0x700(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 SpawnPadPlacementActorRequiredTags;                // 0x728(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObjectLibrary>         FOBCoreLibrary;                                    // 0x748(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLoadFirstCoreInCreationMode : 1;                  // Mask: 0x1, PropSize: 0x10x770(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_F9 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1023[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFOBCoreChoiceArray                   FOBCoreChoices;                                    // 0x778(0xC0)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortFOBCoreDecoItemDefinition*        SelectedCoreItemDef;                               // 0x838(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingFOBCoreActor*                 SelectedCore;                                      // 0x840(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingFOBCoreSpawnPad*              CoreSpawnPad;                                      // 0x848(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFOBSaveFileBuildingInstructionsHandler* SaveFileInstructionsHandler;                       // 0x850(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUniqueNetIdRepl                      OwnerNetID;                                        // 0x858(0x28)(Net, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFOBMode                          FOBMode;                                           // 0x880(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFOBIOStatus                      IOStatus;                                          // 0x881(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1027[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnumeratedUserFilesSuccessfully : 1;              // Mask: 0x1, PropSize: 0x10x884(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCoreBasedDeploymentModeFinalizationRequested : 1; // Mask: 0x2, PropSize: 0x10x884(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInitialized : 1;                                  // Mask: 0x4, PropSize: 0x10x884(0x1)(Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bFinalized : 1;                                    // Mask: 0x8, PropSize: 0x10x884(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDummyDeployment : 1;                              // Mask: 0x10, PropSize: 0x10x884(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_FA : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_102B[0x4B];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnAllBuildingsSpawned;                             // 0x8D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UBoxComponent*                         ContainmentBoxComponent;                           // 0x8E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                  ContainmentBoxStructuralGridBox;                   // 0x8E8(0x1C)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_102D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 SpawnLocationTags;                                 // 0x908(0x20)(Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABuildingFOBConfigActor* GetDefaultObj();

	bool ReloadFOB();
	void OnRep_FOBMode();
	void OnRep_bFinalized();
	void OnIOOperationCompleteMulticast(enum class EFOBIOStatus IOOperation, bool bSuccess, class UFortFOBCoreDecoItemDefinition* SelectedCoreDef);
	void OnFOBModeSet(enum class EFOBMode ModeThatWasSet);
	void OnFinalized();
	void OnFinalizationPlayFX();
	void OnFinalizationFXMulticast();
	void OnCoreInitialized(class ABuildingFOBCoreActor* InitializedCore);
	bool IsPlayerControllerFOBOwner(class AFortPlayerController* FortPC);
	bool IsInitialized();
	bool IsFinalized();
	bool IsBuildingActorWithinFOB(class ABuildingActor* ActorToCheck);
	class UFortFOBCoreDecoItemDefinition* GetSelectedFOBCoreItemDefinition();
	enum class EFOBMode GetFOBMode();
	TArray<struct FFOBCoreChoice> GetAllCoreChoices();
	bool CanSaveFOB();
	bool CanReloadFOB();
	bool CanPerformIOOperation();
	bool AttemptSelectFOBCore(class UFortFOBCoreDecoItemDefinition* DefToSelect);
};

// 0x128 (0x7D0 - 0x6A8)
// Class FortniteGame.BuildingFOBCoreActor
class ABuildingFOBCoreActor : public ABuildingGameplayActor
{
public:
	TSoftObjectPtr<class UParticleSystem>        SimpleDeathParticles;                              // 0x6A8(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USoundBase>             SimpleDeathSound;                                  // 0x6D0(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         SimpleBoundsBoxComponent;                          // 0x6F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         TouchBoxComponent;                                 // 0x700(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               ContainmentVolumeTouchBoxOffsetExtents;            // 0x708(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRegisterAsGlobalGameplayEventListener : 1;        // Mask: 0x1, PropSize: 0x10x714(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bConformTouchBoxToFOBContainmentBox : 1;           // Mask: 0x2, PropSize: 0x10x714(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bActive : 1;                                       // Mask: 0x4, PropSize: 0x10x714(0x1)(Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bTargetable : 1;                                   // Mask: 0x8, PropSize: 0x10x714(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bVulnerable : 1;                                   // Mask: 0x10, PropSize: 0x10x714(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_FB : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1053[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnFOBCoreTargetableChanged;                        // 0x718(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnFOBCoreVulnerableChanged;                        // 0x728(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FUniqueNetIdRepl                      OwnerNetID;                                        // 0x738(0x28)(Net, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortFOBCoreDecoItemDefinition*        SpawnedFromItemDef;                                // 0x760(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABuildingFOBCoreSpawnPad*              SpawnedFromSpawnPad;                               // 0x768(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                  FOBBounds;                                         // 0x770(0x1C)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                  FOBStructuralBounds;                               // 0x78C(0x1C)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnFOBCoreDamaged;                                  // 0x7A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  OnFOBCoreOutOfHealth;                              // 0x7B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                        bShowTargetableHUDIndicator : 1;                   // Mask: 0x1, PropSize: 0x10x7C8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1056[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingFOBCoreActor* GetDefaultObj();

	void OnVulnerableStatusChanged(bool bNewTargetableStatus);
	void OnTargetableStatusChanged(bool bNewTargetableStatus);
	void OnRep_bVulnerable();
	void OnRep_bTargetable();
	void OnRep_bActive();
	void OnActiveStatusChanged(bool bNewActiveStatus);
	void MarkVulnerable();
	void MarkTargetable();
	bool IsActorWithinFOBBounds(class AActor* Actor);
	bool IsActive();
	struct FTransform GetSimpleDeathFXTransform();
	bool GetFOBBoundsCenterAndExtents(struct FVector* OutCenter, struct FVector* OutExtents);
	void GetFOBBoundsBoxOverlappedActors(TArray<class ABuildingSMActor*>* OverlappedActors, bool bSortByDistanceFromCore);
};

// 0x0 (0x6A8 - 0x6A8)
// Class FortniteGame.BuildingFOBCoreSpawnPad
class ABuildingFOBCoreSpawnPad : public ABuildingGameplayActor
{
public:

	static class UClass* StaticClass();
	static class ABuildingFOBCoreSpawnPad* GetDefaultObj();

	struct FTransform GetCoreSpawnTransform();
};

// 0x140 (0xCA0 - 0xB60)
// Class FortniteGame.BuildingFoundation
class ABuildingFoundation : public ABuildingSMActor
{
public:
	TArray<class UBuildingGroup*>                BuildingGroups;                                    // 0xB60(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
